[
  {
    "department": "ACCOUNTING",
    "name": "Wayne Guay",
    "title": "Yageo Professor of Accounting",
    "researchTitle": "",
    "researchDescription": "Professor Guay’s research focuses on the design of executive compensation contracts, stock-based incentives, corporate governance, financial reporting quality, the corporate information environment, and firm valuation. As well as executive stock holdings and trading behavior, corporate governance, and the role of financial transparency in governance and contracting."
  },
  {
    "department": "BIOMEDICAL",
    "name": "James McKay, PhD",
    "title": "Professor of Psychology in Psychiatry",
    "researchTitle": "",
    "researchDescription": "My research focuses on the development and testing of innovative interventions for substance use disorders.  These interventions are adjusted over time based on patients' progress and often include mobile health components, such as smartphone apps and texting.  Our research projects often feature cutting edge methodologies, such as sequential randomization of participants, and sometimes include economic components such as cost-effectiveness and benefit-cost analyses.  In most of our projects we collaborate with publicly funded treatment programs in Philadelphia, where we determine if our new interventions improve outcome over \"treatment as usual.\""
  },
  {
    "department": "HUMANITIES",
    "name": "Grace Sanders Johnson, PhD",
    "title": "Assistant Professor of Africana Studies",
    "researchTitle": "",
    "researchDescription": "Modern Haiti, Black Feminism, Caribbean Feminism, Multi-Modal Methods, Historical Methods, Environmental Humanities, Oral History"
  },
  {
    "department": "BIOMEDICAL",
    "name": "Minglin Liu",
    "title": "Research Assistant Professor Of Dermatology",
    "researchTitle": "",
    "researchDescription": "Mentor Areas: Cell death, extracellular Biology and autoimmune skin diseases, and cardiovascular diseases\n\nDuring programed cell death of different cell types, the dead cells release Extracellular Vesicles (EVs) and/or Extracellular Traps (ETs), which carry potent bioactive molecules that are involved in pathophysiology of various human diseases, including autoimmune diseases. We are studying cellular mechanisms of EVs from different cell types, and neutrophil ETs (NETs) and their pathological involvement in autoimmune diseases."
  },
  {
    "department": "BIOMEDICAL",
    "name": "Olajumoke Fadugba, MD",
    "title": "Associate Professor of Clinical Medicine",
    "researchTitle": "",
    "researchDescription": "The Section of Allergy & Immunology at Penn conducts research in drug allergy, including penicillin allergy. An outdated or erroneous penicillin allergy label is associated with poor clinical outcomes. The A&I Section cares for patients with chronic spontaneous urticaria, and there is interest in studying refractory patient populations. The A&I Section specializes in care of patients with severe or uncontrolled asthma, and there is interest studying this patient population.\n\nDeals with: \n- COVID-19 vaccination reactions and tolerance assessment\n- Evaluation of patients with reported drug allergy\n- Evaluation of patients with reported penicillin allergy\n- Asthma outcomes\n- Chronic urticaria outcomes"
  },
  {
    "department": "BIOMEDICAL",
    "name": "Claire Mitchell",
    "title": "Professor of Cell Biology and Anatomy",
    "researchTitle": "Lysosomal physiology",
    "researchDescription": "Our laboratory investigates the basic mechanisms underlying age dependent neurodegeneration. We are also focused on identifying key points of intervention and testing new approaches to reduce the pathological consequences.\nStudents will be trained to measure lysosomal functioning in healthy and challenged microglial and epithelial cells. Confocal microscopy, cell culture, nanoparticles and qPCR are some of the techniques taught. A student is welcome to help unravel the roles of lysosomal dysfunction in aging diseases. "
  },
  {
    "department": "BIOMEDICAL",
    "name": "Tim Gaulton",
    "title": "Assistant Professor of Anesthesiology and Critical Care",
    "researchTitle": "Epidemiology of Perioperative Driving Risk and Behavior",
    "researchDescription": "I am interested in perioperative outcomes research and learning about unique ways of understanding how patients recovery after surgery and acute illness. I am funded to study the epidemiology of driving behavior and risk after surgery.  I am using data that links hospital encounters and driving statistics (car crashes, citations, licensing) to look at the incidence, predictors, and risk of adverse driving outcomes after common surgical procedures.  I am also interested in learning about what inhibits and motivates patients to drive through patient interviews."
  },
  {
    "department": "BIOMEDICAL",
    "name": "Michael Ashburn, MD, MPH\n",
    "title": "Professor of Anesthesiology and Critical Care",
    "researchTitle": "Pain Research",
    "researchDescription": "The division of Pain Medicine conducts clinical trials related to the treatment of pain, as well as research using large outcome data sets to guide ongoing efforts to improve our process if clinical care.\nThe division of Pain Medicine conducts clinical trials related to the treatment of pain, as well as research using large outcome data sets to guide ongoing efforts to improve our process if clinical care.  Projects will vary. Interested students should contact us to discuss possibilities."
  },
  {
    "department": "BIOMEDICAL",
    "name": "Rich Tsui",
    "title": "Associate Professor of Medical Informatics",
    "researchTitle": "Real-time Clinical AI Systems in Tsui Lab",
    "researchDescription": "The Tsui laboratory (www.tsuilab.com) focuses on real-time clinical AI and machine learning research and deployment. Our research areas include 1) AI machine learning based clinical decision support, 2) natural language processing, 3) mobile Health, and 4) real-time production systems. For clinical decision support, we focus on building predictive models with explanation such as deep neural networks and other machine learning algorithms to detect or predict risks at the patient level or population level, i.e., personalized risk detection or population surveillance. We have  developed big-data approach, i.e., working on various data types including electronic heath records (structured and unstructured data), streaming waveform data, and video data. For natural language processing (NLP), we develop deep learning NLP tools to process unstructured (free-text, narrative) reports from the clinical domain (e.g., discharge summary) and social networks (e.g., Twitter messages). For mobile health, we develop mobile apps that collect various data from users and have the capability to interact with the users. For real-time production systems, we translate research to the bedside through the integration of our research models to a real-time production system that provides real-time decision support to frontend clinicians, hospital staff, and users. The lab is located in the Children’s Hospital of Philadelphia working closely with clinicians to advance medical and clinical informatics to the next level."
  },
  {
    "department": "BIOMEDICAL",
    "name": "Scott Weiss",
    "title": "Assistant Professor of Anesthesiology and Critical Care",
    "researchTitle": "Multiple Organ Dysfunction Syndrome",
    "researchDescription": "Research opportunities include both laboratory and clinical investigation of various aspects of mitochondrial dysfunction and epidemiological investigation in pediatric sepsis.  Laboratory responsibilities would include cell isolation, ELISA, western blotting, and other basic assays.  Clinical responsibilities would include medical chart review, data abstraction, and analysis.  Positions can be negotiated for short-term projects, though longitudinal commitments are preferred.  Responsibilities can be customized to the student’s interest and skill set.\nDr. Weiss’ research focuses primarily on Biomarkers, Microcirculatory and mitochondrial dysfunction, Multiple Organ Dysfunction Syndrome (MODS), and especially septic shock."
  },
  {
    "department": "SOCIAL SCIENCE",
    "name": "Jessa Lingel, PhD",
    "title": "Assistant Professor",
    "researchTitle": "Building a grassroots internet: Mesh networks in Philadelphia",
    "researchDescription": "Lingel’s research focuses on three key areas: alterity and appropriation, and investigations of how information and technology is altered, tinkered with, subverted, and articulated by marginalized groups; politics of infrastructure, where systems of categorization, organization, and design can reveal underlying ideologies and logics; and technological activism as a way of exploring how socio-technical practices can contribute to projects of social justice.\nJust before the COVID-19 pandemic, a study revealed a significant digital divide in Philadelphia, with only 53% of Black and 44% of Latinx residents having broadband access compared to 77% of the general U.S. population. The pandemic worsened these inequalities, impacting education, businesses, and job seekers. This project aims to address the issue by creating community-controlled mesh networks to provide free internet access and promote digital literacy, empowering marginalized communities. Mesh networks distribute bandwidth efficiently, making them resilient and reflective of democratic, participatory, and decentralized principles."
  },
  {
    "department": "SOCIAL SCIENCE",
    "name": "Dolores Albarracín, PhD",
    "title": "Professor",
    "researchTitle": "Communication, Conspiracy Theories, & Health Policy",
    "researchDescription": "Dr. Albarracín studies the impact of communication and persuasion on human behavior and the formation of beliefs, attitudes, and goals, particularly those that are socially beneficial (e.g., health promotion in the area of vaccines, HIV, lifestyle, and substance use). The lab also has projects on conspiracy theories and interactions with public health agencies, including how to improve communication policy through the use of social media in rural and urban areas of the United States. In addition to an interest in basic attitudinal processes and health promotion, she is interested in finding ways of curbing misinformation. Dr. Albarracin's research team includes researchers with diverse expertise, including informatics, economics, psychology, neuroscience, and statistics. Students working in the lab can thus get interdisciplinary research experience and be mentored by several researchers."
  },
  {
    "department": "BUSINESS AND ECONOMICS\nENGINEERING AND COMPUTING\nSOCIAL SCIENCE",
    "name": "Duncan Watts, PhD",
    "title": "Stevens University and PIK Professor",
    "researchTitle": "Computational Social Science",
    "researchDescription": "I am broadly interested in topics at the intersection of social science and computer science, with a particular interest in computational studies of media, collective intelligence, network diffusion, and common sense.\n4 Areas Students can Contribute to: \nMedia Analytics Project aims to understand the information ecosystem in media (web and TV) and develop tools for public knowledge improvement. Research opportunities include data engineering, statistical modeling, and text processing for structured data in AWS databases.\n\nQuantifying Commonsense investigates the prevalence of commonsense and its influence on AI systems. This project conducts online experiments and predicts individuals' commonsense levels based on their beliefs. Opportunities involve contributing to experiment components and data analysis.\n\nHigh Throughput Virtual Lab Experiments for Team Performance focuses on studying team performance with multiple variable manipulations. Repeated experiments with minor variations help uncover the impact of individual factors on team performance. Opportunities include variable selection, experiment execution, and analysis.\n\nVisualizing COVID addresses the challenges of COVID data visualization for decision-makers. The project creates interactive visualizations using tools like D3, Vega, Observable, and ESRI to aid in understanding and decision-making. Opportunities involve designing and executing visualizations for local government use."
  },
  {
    "department": "BIOMEDICAL\nSOCIAL SCIENCE",
    "name": "Katherine Moore, Ph.D.",
    "title": "Practice Professor, Anthropology",
    "researchTitle": "Zoorarchaeology at the Center for Analysis of Archaeological Materials",
    "researchDescription": "Mentor Areas: I work on how animals have been key as food, assistants, and companions for humans. This work can include cases when humans and animals reflect their changing shared ecology upon climate and habitat change. I am working on prehistoric animal use in South America and Central Asia, and am also active on several projects in North America on animal use in historic times. The research process includes processing and identifying the remains, recording biological and cultural traces, and interpretation of assemblages. While relying on biological features, the questions addressed are primarily cultural and anthropological.\nDescription: Research in the Center for the Analysis of Ancient Materials takes place in the Zooarchaeology Lab in the Penn Museum. Undergraduate could be involved in several projects related to animal use in prehistoric Latin America and North America. For students with specific background, projects could lead to thesis projects in anthropology, Classics, or Biology. Several projects on historical archaeology are available for 2021-2022, but would require coursework preparation."
  },
  {
    "department": "HUMANITIES\nSOCIAL SCIENCE",
    "name": "Richard Leventhal, Ph.D.",
    "title": "Professor of Anthropology and Executive Director of the Penn Cultural Heritage Center of the Penn Museum",
    "researchTitle": "Preservation of Cultural Heritage",
    "researchDescription": "Cultural heritage preservation, community development, illegal trafficking of antiquities, Museums and future Museum developments. Archaeology, Anthropology, public engagement, Mesoamerica and Central America. The Penn Cultural Heritage Center also has heritage projects ongoing in California, Italy, Syria, Iraq, and Turkey."
  },
  {
    "department": "SOCIAL SCIENCE",
    "name": "Theodore Schurr, Ph.D.",
    "title": "Professor in the Department of Anthropology, and a Consulting Curator in the Physical Anthropology and American Sections of the University of Pennsylvania Museum of Archeology and Anthropology",
    "researchTitle": "The Role of Genetic Ancestry in HPV Infection",
    "researchDescription": "The primary goal of this project is to better understand the epidemiology and risk factors involved in cervical cancer incidence and progression in populations from Misiones Province in northeastern Argentina, including Guarani Indians. This study will also help to illuminate the genetic history of the Guarani Indians and their relationship to other indigenous South American populations, along with the extent of European admixture in them. We are currently analyzing the prevalence of human papillomavirus (HPV) infection, viral types, viral variants, lesions associated with infections, and risk factors involved in the development of cervical cancer, as well as genetic variation in the mtDNAs and other autosomal loci in Guarani, criollo and white populations from the Misiones Province.\nMentor Areas: Human evolutionary genetics, mitochondrial biology and disease, biomedical genetics, ancient DNA Geographic areas: Africa, the Americas, Australia, Georgia (Caucasus), Melanesia, Siberia, South Asia, Southeast Asia, Turkey"
  },
  {
    "department": "ENGINEERING AND COMPUTING",
    "name": "Joseph Scandura, PhD",
    "title": "GSE Emeritus Professor",
    "researchTitle": "Authoring and Delivering Adaptive Tutoring Systems",
    "researchDescription": "Emeritus Professor Joseph Scandura is seeking students to enhance a unique family of patented authoring systems and/or to use these authoring systems to develop tutoring systems in their areas of interest.  The former will require various levels of programming skills (ranging from a variety of front end skills to VC/C++/C# on the back end).  The latter will require good computer technical skills and a strong desire to improve education, ranging from elementary school through technical training and beyond.\n"
  },
  {
    "department": "BIOMEDICAL",
    "name": "Jenny Shao, MD",
    "title": "Robotic surgery for Medium Sized Ventral/Incisional Hernias\nAssessment of GERD in Bariatric Patients\nAeroSSOL Study: Aerosolization of COVID-19 in Open and Laparoscopic Surgery\nRCT: Medical vs Interventional therapy for EGJOO",
    "researchTitle": "Clinical Research in Surgery",
    "researchDescription": "Interested in clinical and outcomes research based in foregut (benign esophageal motility disorders, GERD, etc.), bariatric surgery, and hernia surgery. Working on projects that involve diversity in surgery, COVID related research projects, please contact me for additional information. Currently doing several projects in foregut, bariatric, and hernia surgery. Also interested in diversity and equity research in surgery."
  },
  {
    "department": "BIOMEDICAL",
    "name": "Samuel Hurcombe, BSc, BVMS, MS, DACVIM, DACVECC",
    "title": "Associate Professor of Large Animal Emergency and Critical Care",
    "researchTitle": "Large animal emergency surgery and critical care medicine",
    "researchDescription": "Use of novel methods for mesenteric vessel ligation in equine colic surgery, Comparison of small intestinal anastomotic techniques for jejunal resection in horses. Use of a novel skin closure method for ventral midline incisions in horses undergoing abdominal surgery. Evaluation of cell free DNA in blood of critically ill neonatal foals. We have several projects investigating novel surgical techniques in horse abdominal surgery. Student roles can be helping with procedures, horse handling, performing physical examinations, and data recording\n"
  },
  {
    "department": "HUMANITIES",
    "name": "Daud Ali, PhD",
    "title": "Associate Professor of South Asian Studies",
    "researchTitle": "Medieval Copper Plate Seals from South India",
    "researchDescription": "Mentor Areas: Medieval Indian history. Sanskrit and Tamil language sources.\nComparison of Copper Plate seals in Chola and Pandya History. The seals of copper plate inscriptions depict symbols of royalty and were a general feature of early medeival lineages. In the case of South India, it has been long recognized that the seals of the Pandyas and Cholas depict not only generic royal paraphernalia, but specific symbols associated with allied and rival dynasties. This research project will analyze the placement of these symbols in the context of dynastic change in south India."
  },
  {
    "department": "SOCIAL SCIENCE",
    "name": "Xi Song",
    "title": "Associate Professor of Sociology",
    "researchTitle": "Changing Occupational Structure and Social Mobility",
    "researchDescription": "Mentor Areas: My research interests include social stratification and mobility, poverty, inequality, population studies, and quantitative methodology. My current research projects examine social, economic, and demographic processes that govern the persistence of inequality across life stages and generations in the United States and China from the 18th century to the present.\n\nThis project will integrate various occupational data from the Dictionary of Occupational Titles, O*NET, Occupational Outlook Handbook, decennial U.S. Census, American Community Survey, and other surveys. The project offers researchers the ability to utilize longitudinal data from U.S. government archival and administrative sources on occupations, jobs, and workforce from the 1930s to the present. The research team will examine changes in occupational structure, particularly the emergence of new occupations and declines of obsolete occupations as the US economy evolved over the past 80 years. Furthermore, the proposed project will examine long-term trends in inequality with regard to changing occupational opportunities for different social, economic, and demographic groups.\n\n"
  },
  {
    "department": "SOCIAL SCIENCE",
    "name": "Hans-Peter Kohler, Ph.D.",
    "title": "Frederick J. Warren Professor of Demography",
    "researchTitle": "Surviving the Epidemic: Families and Well-Being, Malawi 1998—2020",
    "researchDescription": "The research opportunity essentially entails research assistance in a new project on \"Surviving the Epidemic: Families and Well-Being, Malawi 1998—2020\" that addresses the following research questions: Across Eastern and Southern Africa (ESA), a remarkable cohort is reaching middle and older ages: those who have survived the AIDS epidemic. Some were infected with HIV, but everybody in this co- hort was affected by HIV. Nobody could escape an epidemic that was devastating for both its health and social implications, and one that struck hard in a region also dealing with poverty, famines, and basic uncertainties of life.\n\nMentor Areas: Hans-Peter Kohler's primary research focuses on fertility and health in developing and developed countries. A key characteristic of this research is the attempt to integrate demographic, economic, sociological and biological approaches in empirical and theoretical models of demographic behavior. For example, Kohler has been investigating the bio-social determinants of fertility, the causes of low- and lowest-low fertility in Southern and Eastern Europe, the causal effects of education on health, the interrelations between marriage and sexual relations in developing countries, the role of subjective expectations and risk assessments for understanding demographic outcomes, the importance of social interaction processes for fertility and AIDS-related behaviors, and demographic methods for measuring and forecasting fertility trends."
  },
  {
    "department": "SOCIAL SCIENCE",
    "name": "Jennifer Prah Ruger",
    "title": "Amartya Sen Professor of Health Equity, Economics, and Policy",
    "researchTitle": "Global and Domestic Health Economics and Ethics",
    "researchDescription": "Jennifer Prah Ruger's work focuses on reducing health inequities, particularly among impoverished populations, with a special emphasis on women and children. Dr. Prah Ruger combines expertise in political economy, health policy, international relations, social research, and law to reevaluate and apply underlying principles to health policy and public health empirically. She introduced the health capability paradigm, challenging conventional approaches and assessing health policies against this paradigm. Her research scrutinizes global health structures to improve global health policies, connecting public policy and law at both global and national levels. Her work encompasses various critical health policy areas, including health system access, financing, resource allocation, policy reform, and social determinants of health. She conducts research internationally, including in countries like Ghana, India, Indonesia, the United States, and more."
  },
  {
    "department": "HUMANITIES",
    "name": "Eva De Soldato, PhD",
    "title": "Associate Professor of Romance Languages",
    "researchTitle": "Italian Vernacular as a Language of Elevated Discourse",
    "researchDescription": "Eva Del Soldato was trained in Philosophy and Intellectual History at the Scuola Normale Superiore di Pisa. Her research is primarily devoted to Renaissance thought and culture, with a special attention to the Aristotelian and Platonic traditions. She also cultivates interests in history of book, history of libraries and universities, and in Twentieth-century cultural institutions. She is the author of the monograph Simone Porzio (Edizioni di Storia e Letteratura, 2010), and of several articles and editions, including the Italian translation of Bessarion's In calumniatorem Platonis (2014). She has recently co-edited the volume City, Court, Academy. Language Choice in Early Modern Italy (Routledge, 2017). Her monograph, Early Modern Aristotle. On the Making and Unmaking of Authority (University of Pennsylvania Press, 2020), is devoted to the strategic uses of Aristotle (and Plato) as authorities in the Early Modern Period. She is currently working on a study focused on Antonio Brucioli and the Venetian printing world, which takes into consideration the spread of the vernacular as a language of elevated discourse. She is very happy to engage and mentor students virtually."
  },
  {
    "department": "HUMANITIES",
    "name": "Julia Verkholantsev",
    "title": "",
    "researchTitle": "Digital Database: Myths of Origin in Medieval Chronicles of Europe",
    "researchDescription": "The project deals with the creation of a digital database to analyze a range of questions about the ‎role of myths of origin in medieval and early modern chronicles and historiographic sources of ‎Europe. “Myths of origin” are legendary stories that describe genealogies of ethnic groups, their ‎social orders, names, and places that they inhabit. The goal of the project is to understand what ‎motivated medieval authors to view myths as “historical material” and how they adopted myth to ‎fit their learned vision of what History should be? Many of these myths are built around ‎etymological interpretations of names of people and objects because medieval historians ‎believed that connections between similarly sounding words provided a mystical link to the ‎otherwise unknowable reality of the distant past. "
  },
  {
    "department": "BIOMEDICAL",
    "name": "Joshua Baker  MD, MSCE",
    "title": "Associate Professor of Medicine and Epidemiology",
    "researchTitle": "Obesity, skeletal muscle health, and their importance in chronic musculoskeletal and rheumatic diseases",
    "researchDescription": "Mentor Areas: I have been interested in aspects of care of rheumatic disease such as rheumatoid arthritis and osteoarthritis. I have a particular interest in how arthritis interacts with obesity, sarcopenia, disability, and long-term outcomes such as mortality, cardiovascular disease, and fracture. I am also interested in methods to evaluate and study the long-term impacts of body composition in all patient populations including among older adults."
  },
  {
    "department": "BIOMEDICAL",
    "name": "Fusun Ozer",
    "title": "Associate Professor of Restorative Dentistry",
    "researchTitle": "Material Adhesion and Biologically Stable Adhesive/dentin Interface",
    "researchDescription": "Dr. Ozer has a broad research background in adhesive dentistry, with specific training and expertise in research areas of material adhesion and developing more biologically stable adhesive/dentin interface.\n\nMussel-derived molecules and polymers have been studied and have had great success as an adhesive in the field of medicine. Medical researchers have tried to convert this natural bioadhesive into a catechol-containing synthetic adhesive for medical sealants and multifunctional polymer coatings. In doing so, they have created a monomer that can be also used in dentistry as a primer to help facilitate an increase in bond strength under wet conditions. In one of our studies, we will evaluate shear bond strengths of two different adhesive resin systems to dentin surfaces after application of the experimental mussel-biomimetic primer with or without thermal aging in wet conditions in order to increase the durability of resin dentin interfaces.\n\nHer basic research interests focus on determining the contribution of matrix metalloproteinases (MMPs) to enzymatic degradation at resin/dentin interfaces and trying to prevent their activity by using the proprietary MMP 8 and 9 derived peptide inhibitors. One of her recent research projects involves assessing the impact of bacteria on the degradation process of dentinal resin bonding and what can be done to reduce bacterial adhesion at the margins of resin restorations."
  },
  {
    "department": "HUMANITIES",
    "name": "Reyhan Durmaz, Dr.",
    "title": "Assistant Professor of Religious Studies",
    "researchTitle": "Visualizing Countryside: Rural Christianities in the Medieval Middle East",
    "researchDescription": "My project, \"Visualizing Countryside,\" aims to build a digital archive of architectural photographs of medieval churches and monasteries in the Middle East. The project has two phases: Firstly,we will edit and categorize about 500 photographs of medieval churches, monasteries, and hermitages, mostly from northern Mesopotamian countryside. In the second phase, the project team will curate this material and build a website for the archive, in collaboration with the Price Lab. The final product will be a digital photograph archive, consisting of an interactive map and a searchable database, for the use of students, scholars, and anybody else interested in the history of Christianity in the medieval Middle East."
  },
  {
    "department": "BIOMEDICAL\nENGINEERING AND COMPUTING",
    "name": "Michelle Johnson, Ph.D.",
    "title": "Assistant Professor of Physical Medicine and Rehabilitation",
    "researchTitle": "Robot-mediated Rehabilitation",
    "researchDescription": "Mentor Area: My research is mainly in the area of robot-mediated rehabilitation. I am focused on the investigation and rehabilitation of dysfunction due to aging, neural disease, and neural injury. I am particularly interested in 1) exploring the relationships between brain plasticity and behavioral/motor control changes after robot-assisted interventions; 2) quantifying motor impairment and motor control of the upper limb in real world tasks such as drinking using robotics; 3) defining the methods to maintain therapeutic effectiveness while administering local and remote, robot-mediated interventions; and 4) designing affordable robot and mechatronic systems for developed and developing countries.\n\nI direct the Rehabilitation Robotics Lab. This Lab within the Department of Physical, Medicine, and Rehabilitation in the Perelman School of Medicine that is also affiliated with The GRASP Lab in the School of Engineering and Applied Sciences. Rehabilitation Robotics Lab mission is to use robotics, rehabilitation, and neuroscience techniques to translate research findings into the development of assistive and therapeutic rehabilitation robots capable of functioning in real-world rehabilitation environments. Our goal is to improve the quality of life and function on activities of daily living (ADLs) of our target population in supervised or under-supervised settings. "
  },
  {
    "department": "BUSINESS AND ECONOMICS",
    "name": "Susan Wachter, PhD",
    "title": "Professor of Finance",
    "researchTitle": "Analysis of Real Estate Investment Trusts (REITs)",
    "researchDescription": "We have several on-going projects related to analysis of Real Estate Investment Trusts (REITs), Private Label Mortgage Backed Securities and macro prudential policy, in the lead-up and aftermath of the 2008 financial crisis."
  },
  {
    "department": "ENGINEERING AND COMPUTING",
    "name": "Ali Dhanaliwala, MD, PhD",
    "title": "Resident Physician",
    "researchTitle": "HoloLens app development - expert eye tracking",
    "researchDescription": "Mentor Area: The interests of our laboratory focus on translational research for the development of novel imaging approaches and advanced therapeutics in interventional radiology. Emphasizing a team science approach focusing on the convergence of image-guided interventions, cancer/vascular biology and molecular imaging, our research is motivated by clinical deficiencies and seeks to go from bedside-to-bench and back again to further diagnosis and treatment.\nAs part of our initiative to bring augmented reality to interventional radiology we are developing a toolkit of applications for the Microsoft HoloLens that can be used from before scrub-in to after case end. We are currently looking for people interested in developing an eye tracking application that can measure experts and guide non-experts."
  },
  {
    "department": "BIOMEDICAL",
    "name": "Kavindra Nath, PhD",
    "title": "Research Assistant Professor of Radiology",
    "researchTitle": "Cancer Metabolic Imaging",
    "researchDescription": "Mentor Areas: Development of a safe and reproducible method to selectively acidify and de-energize the human cancers. Specifically, we seek to employ the natural tendency of cancers to convert glucose to lactate as a method for selective intracellular acidification, which is known to potentiate tumor response to chemotherapy, radiation therapy. In vivo 31P and 1H Magnetic Resonance Spectroscopy demonstrated that human cancer xenografts such as melanoma, breast, prostate and ovarian in immunosuppressed mice treated with metabolic modulators exhibit a sustained and tumor-selective decrease in pH, bioenergetics and increase in lactate and subsequent sensitization to chemotherapy and radiation therapy.\nThere is a critical need to develop methods to sensitize metastatic prostate cancer, the most common cancer in men and second most deadly, to taxane chemotherapy. While short-term androgen deprivation therapy is effective at treating prostate cancer, approximately half of the cases progress to metastatic castration-resistant prostate cancer, which is non-responsive to hormonal therapies. We propose to use metabolic modulators to enhance the chemotherapy, and sophisticated MR imaging and spectroscopic (MRI\\MRS) techniques to assess the effect that the modulators have on the model systems to be studied."
  },
  {
    "department": "BIOMEDICAL SCIENCE\nENGINEERING AND COMPUTING\nSOCIAL SCIENCE",
    "name": "Martha Farah, PhD",
    "title": "Annenberg Professor in Natural Sciences",
    "researchTitle": "Analyzing neuroscience “big data”: 40,000 brain scans with behavioral, genetic and socioeconomic characteristics",
    "researchDescription": "Students will work with a mentor and formulate a subproject within the larger ongoing investigation, for which they will be responsible. They will need to begin with a strong background in quantitative methods and some coding experience, and will go on to review or learn data wrangling, machine learning and/or advanced forms of regression analysis.  They will also read and discuss research on the neuroscience of SES, participate in lab meetings, develop their presentation skills and write a final report for independent study credit.  This research experience can be continued for a second semester, and may be continued over the summer for pay.\nOur lab pioneered the study of socioeconomic status (SES) in neuroscience. We are now mining data on the brain structure and function of 40,000 adult Britons, as well as abundant information on their SES, cognitive and emotional status, genetics and health. There are many hypotheses to be tested about why and how SES influences the brain, and hence drives inequality in so many important life outcomes. And given the size of the sample, there is scope for careful, disciplined discovery science."
  },
  {
    "department": "BIOMEDICAL",
    "name": "Harvey Grill, PhD",
    "title": "Professor Of Behavioral Neuroscience",
    "researchTitle": "Defining Neural Circuits Controlling Body Weight, Food Seeking and Food Reward",
    "researchDescription": "Our behavioral neuroscience lab studies hormonal and neurochemical signals that act on central neural circuits to control energy balance (feeding behavior, energy expenditure, and body weight regulation) and, relatedly, food motivation, food seeking, and learned associations between food and environmental cues. We seek to define the neurochemical signals that trigger a response (ex. food intake inhibition), site of action, the neural pathways that mediate this response. Chemical signals that we are currently investigating include GLP-1, oxytocin, GDF-15, CCK, and ghrelin. Students will be involved in projects that include both acute and chronic administration of chemical signals, food and body weight measurements, as well as several behavioral paradigms that examine appetitive feeding responses and motivated feeding behavior."
  },
  {
    "department": "SOCIAL SCIENCE",
    "name": "Barbara Mellers, PhD",
    "title": "Professor of Psychology; Professor of Marketing",
    "researchTitle": "Predictions about Geopolitical Events",
    "researchDescription": "Mentor Area: I am interested in how and why people develop preferences, build up beliefs, update them, make judgments,  and arrive at choices, I study how people’s actual judgments and decisions deviate from principles of logic and rationality due to considerations of fairness, anticipated emotions, contextual effects, or response mode effects (i.e., how the question is asked). I  use laboratory studies to manipulate and control variables that tell us about underlying processes. I also do larger scale field experiments to study how to improve human predictions of geopolitical and economic events. I am interested in how political orientations influence predictions and how to  to reduce polarization and correct for noise and biases. These interests stem from the basic question of how behavioral decision making can shape better public policies and interventions."
  },
  {
    "department": "SOCIAL SCIENCE",
    "name": "Tulia Falleti, PhD",
    "title": "Class of 1965 Endowed Term Professor of Political Science; Director of Latin American and Latinx Studies Program",
    "researchTitle": "\"Dispossessions in the Americas” Penn-Mellon Just Futures Research Assistants",
    "researchDescription": "The “Dispossessions in the Americas” Just Futures Project will document territorial, embodied, and cultural heritage dispossessions in the Americas. We aspire to collectively outline and identify models of repossession and the processes through which the restoration of land, embodiments, and cultural heritage can recover histories and promote restorative justice. Our research assistants are obtaining information for each Indigenous peoples group in Latin America. They are researching geographic location over time, population over time, migration patterns, merging or mixing with other Indigenous groups, and much more. The RAs are coding this information, which will eventually help us create a map that shows territorial realities for the entire Western Hemisphere, including the island nations, denoting current reservation lands, ancestral territories, and connections to other tribal nations today. Our map will allow users to better visualize and understand the historical processes of dispossession, relocation, and reclamation. This is to say, our map will capture and narrate the territorial dispossession changes taking place from 1492 to the present and the resulting restorative justice demands."
  },
  {
    "department": "SOCIAL SCIENCE",
    "name": "Paul Silva, II",
    "title": "Doctoral Student of Political Science",
    "researchTitle": "Economic Interdependence and Economic Sanctions: A Case-Study of EU Sanctions on Iran",
    "researchDescription": "How does economic interdependence affect a state's propensity to impose economic sanctions?\nThis project seeks to determine the effect bilateral economic interdependence of EU member states on Iran has on EU member state's support for economic sanctions against the regime. Students will learn how to calculate bilateral economic interdependence and will examine speeches made by members of the European Parliament. Students will learn some basic content analysis skills and will use them to \"code\" or classify speeches made by members of the European Parliament on the following five point scale: 1=very opposed; 2=opposed; 3=indeterminate/neutral; 4=supportive; 5=very supportive"
  },
  {
    "department": "PHYSICAL AND NATURAL SCIENCES",
    "name": "Marija Drndic  Ph.D.",
    "title": "Professor",
    "researchTitle": "Nanoscience and experimental physics",
    "researchDescription": "Mentor Areas: My research and the research in our lab is focused on the exploration of mesoscopic and nanoscale structures in the areas of experimental condensed matter physics, nanoscience and nanotechnology. We study the fundamental physical properties of low-dimensional and small-scale structures such as nanocrystals, nanowires and biomaterials and we develop their device applications. Examples include the study and control of nanocrystal assembly, fabrication of electronic devices and understanding the basic mechanisms of charge and spin transport in them: the effects of Coulomb interactions, electron tunneling and charge fluctuations. Experimental techniques involve electrical measurements, microscopy, and nanofabrication. Some specific research topics include: Nanocrystal synthesis, assembly and manipulation Nanoparticle-based electronics Fluorescence of single nanoparticles and nanoparticle ensembles Molecular analysis with nanoelectrode devices Force microscopy of nanoparticles Nanofabrication (nanogaps, TEBAL) Charge detection with mesoscopic structures Graphene nanodevices and nanoelectronics Single-molecule (DNA, microRNA etc.) detection and analysis with nanopores.\nExperimental and modeling work includes: 2D materials, nanopores, nanoelectronics, quantum computing"
  },
  {
    "department": "PHYSICAL AND NATURAL SCIENCES\nENGINEERING AND COMPUTING",
    "name": "Arjun Yodh, Ph.D.",
    "title": "James M. Skinner Professor of Science and Director, LRSM",
    "researchTitle": "Condensed Matter Physics Experimental Lab",
    "researchDescription": "Students will work on soft condensed materials experiments which explore science of colloids, liquid crystals, glassy materials, polymers, etc. Much of the research involves experimental tools of optical microscopy and micromanipulation, light scattering, laser spectroscopy, wet chemistry, computation, and/or theory (e.g., statistical mechanics, rheology, optics, etc.)"
  },
  {
    "department": "BIOMEDICAL SCIENCE\nENGINEERING AND COMPUTING",
    "name": "Stefan Gysler, MD",
    "title": "Assistant Professor of Clinical Obstetrics and Gynecology",
    "researchTitle": "Using Artificial Intelligence to predict success in Ovarian Cancer Surgery",
    "researchDescription": "We are seeking undergraduates who wish to learn more about radiology, artificial intelligence, surgery and/or gynecology oncology to assist with a novel research project combining artificial intelligence with clinical medicine. Research assistants will help to review CT scan images and segment images to train an AI algorithm to predict success of ovarian cancer surgery. Researchers will also have an opportunity to observe ovarian cancer surgery and work with Gynecologic Oncologists and Radiologists to improve their ability to read actual patient CT scans. "
  },
  {
    "department": "BIOMEDICAL",
    "name": "Wenqin Luo, Dr.",
    "title": "Associate Professor of Neuroscience",
    "researchTitle": "Build a 3D Imaging Arena to Study Mouse Behaviors",
    "researchDescription": "Mentor Areas: One long term goal of my lab is to understand molecular and circuitry mechanisms that mediate and modulate pain and itch sensation and how these mechanisms may change in pathological conditions and lead to chronic pain and itch.  We use a combination of mouse genetics, optogenetics, physiological recordings, in vivo imaging, novel behavior assays, and primary human tissues to address these questions."
  },
  {
    "department": "HUMANITIES",
    "name": "Jairo Moreno, Ph.D.",
    "title": "Associate Professor Of Music",
    "researchTitle": "Latin American Studies, Sound Studies",
    "researchDescription": "I work on Latin American music in the US, with a focus on historically shifting understandings by either \"\"side\"\" of the other. The emphasis is on Popular Music forms from the second half of the 20th century. Another project deals with midwifery, the use of sound as a form of knowing ante-natal life, and a comparative analysis of how different societies conceive of ante-natal life. The areas include Colombia and Brazil."
  },
  {
    "department": "PHYSICAL AND NATURAL SCIENCES",
    "name": "Xin Sun, Prof.",
    "title": "Assistant Professor of Mathematics",
    "researchTitle": "Random geometry and statistical physics",
    "researchDescription": "My research area is probability theory and mathematical physics. My recent research is focused on 2D random geometry and statistical physics, including SLE, Gaussian free field, random planar maps, Liouville quantum gravity and Liouville conformal field theory. I have also worked on uniform spanning trees and abelian sandpiles, as well as random matrices, fractional Gaussian fields and the Airy line ensemble."
  },
  {
    "department": "ENGINEERING AND COMPUTING",
    "name": "Jennifer Phillips-Cremins, PhD",
    "title": "Assistant Professor of Bioengineering",
    "researchTitle": "CRISPR/Cas9 Genome Editing to Study 3D Genome Folding in Brain Disease",
    "researchDescription": "The Cremins lab investigates the link between three-dimensional organization of genomes and the establishment and maintenance of cellular function. We employ molecular Chromosome-Conformation-Capture technologies and high-throughput sequencing to create high-resolution 3-D genome architecture maps. We also develop and apply computational tools to (1) create 3-D models of chromatin and (2) integrate 3-D architecture maps with genome-wide maps of epigenetic modifications.\nCurrent work is focused on understanding the role for higher-order chromatin organization during differentiation of embryonic stem cells into neurons and during reprogramming of somatic cells into induced pluripotent stem cells. We perturb cellular systems using genetic engineering approaches to discover mechanisms regulating chromatin organizing principles."
  },
  {
    "department": "BUSINESS AND ECONOMICS",
    "name": "Jonah Berger",
    "title": "Marketing Professor",
    "researchTitle": "Using Natural Language Processing and Machine Learning to Understand Why Things Catch On",
    "researchDescription": "Why do some songs, books and movies catch on and become popular while others fail? Why do some online articles suck us in and get lots of engagement while others don’t? We’re interested in using natural language processing, machine learning, and automated textual analysis to help answer these questions and related questions.\nOngoing projects involve analyzing song lyrics to predict Billboard rankings, analyzing movies scripts to plot the emotional arc of narratives and predict ratings and ticket sales, and analyzing online content to understand why certain articles get longer versus shorter reads. Students will work with Professor Jonah Berger and potentially some graduate students in our group. Ideal applicants will have strong programming skills, be highly motivated, and able to work independently as well as within a team.\n\n"
  },
  {
    "department": "ENGINEERING AND COMPUTING",
    "name": "Firooz Aflatouni, PhD",
    "title": "Assistant Professor Of Electrical Engineering",
    "researchTitle": "Integrated Circuits For Imaging, Sensing, Communication, and Autonomous Systems",
    "researchDescription": "Electronic and photonic circuit design for 3D imaging and LIDAR, projection systems, wireless communication, optical communication, bio-implantable devices, neural stimulation and recording, bio-sensors, and bio-inspired unconventional computation."
  },
  {
    "department": "ENGINEERING AND COMPUTING",
    "name": "Elena Bernardis",
    "title": "Research Assistant Professor",
    "researchTitle": "Computer Vision for Dermatology",
    "researchDescription": "Creating and deploying automated computational imaging tools for the dermatology clinic. We have various projects available that can be tailored to specific interest and background. Some examples include: computer vision research to extract features of clinical interest,  computer graphics  modeling to create synthetic datasets for training neural networks,  statistical studies to correlate dermatology diseases with other conditions, testing and improving new interfaces for teledermatology.\n"
  },
  {
    "department": "BUSINESS AND ECONOMICS\nHUMANITIES\nSOCIAL SCIENCE",
    "name": "Charles Loeffler",
    "title": "",
    "researchTitle": "Historical Study of Redlining in Boston",
    "researchDescription": "Mentor Areas: Successful candidates will learn to work with contemporary and historical GIS sources and manuscripts. They will also become familiar with how these tools can be used to produce modern spatial econometric estimates for program evaluation. \n\nOver fifty years ago the City of Boston experimented with the rapid expansion of mortgage credit within a geographically constrained area that historically had been neglected by area banks. Historians and social scientists disagree whether this helped, harmed, or had little impact on the trajectory of the affected neighborhoods. This research project aims to shed new light on this question using recently digitized records. Successful applicants will be asked to identify affected properties using historical maps and then locate property information in corresponding digitized collections for incorporation into a pre-existing research database."
  },
  {
    "department": "SOCIAL SCIENCE",
    "name": "Cary Coglianese, JD, PhD",
    "title": "Edward B. Shils Professor of Law and Professor of Political Science",
    "researchTitle": "Regulation and Regulatory Processes",
    "researchDescription": "Professor Coglianese specializes in the study of regulation and regulatory processes, with an emphasis on the empirical evaluation of alternative regulatory strategies and the role of public participation, negotiation, technology, and business-government relations in policymaking. He has also recently written on climate change policy, transparency in federal rulemaking, the use of artificial intelligence by government agencies, and voluntary environmental programs. Feel free to visit his SSRN page for additional information on his research interests: https://papers.ssrn.com/sol3/cf_dev/AbsByAuth.cfm?per_id=45817."
  },
  {
    "department": "ENGINEERING AND COMPUTING",
    "name": "Masoud Akbarzadeh  PhD",
    "title": "Assistant Professor of Architecture in Structures",
    "researchTitle": "Ultra High Performance Structures",
    "researchDescription": "PSL is an interdisciplinary research lab connecting architecture, structural engineering, computer science, mathematics and material science to enrich architectural geometry and to reconcile function, form, and technology. PSL aims to bridge the gap between architecture and structural design using geometry, which is considered the common language between these two inextricable disciplines. At PSL we intend to push the boundaries of research in the field of architectural technology, and we are continually looking for teams and individuals to interact with across various academic disciplines."
  }
]
