[
  {
    "name": "180 Degrees Consulting",
    "explanation": "We are a student group at the University of Pennsylvania that consults for social-impact focused businesses. We create value for them through a variety of projects, including new product development, industry research, and marketing campaigns.\n\nOur goal is to strengthen the ability of socially conscious organizations to achieve high-impact social outcomes. We also aim to foster an environment in which consultants can grow as professionals, as individuals, and as a community.\n\nWe're excited to meet you! Please sign up for our listserv here and visit our Facebook page to stay up to date with recruiting information: https://www.facebook.com/penn180dc. All of the relevant links for recruiting can be found on our linktree.",
    "cleanedExplanation": "A student consultancy at the University of Pennsylvania focusing on social-impact businesses. Projects include product development, industry research, and marketing. The group enhances the impact of social organizations and provides professional growth opportunities for its members."
  }
  ,
  {
    "name": "Alpha Iota Gamma",
    "explanation": "Alpha Iota Gamma, or ΑIΓ for short! ΑIΓ is the first and only professional healthcare fraternity at the University of Pennsylvania. Founded in the spring of 2009, ΑIΓ serves as a professional, academic, and social foundation for students interested in healthcare.\n\nAll Freshmen, Sophomores, and Juniors interested in healthcare are welcome! This includes anyone interested in bioengineering, healthcare management, health policy, medicine, nursing, pre-vet, pre-dental, research, and SO much more.",
    "cleanedExplanation": "The first professional healthcare fraternity at the University of Pennsylvania, offering a platform for students interested in diverse healthcare fields including bioengineering, healthcare management, and medicine."
  },
  {
    "name": "Aspiring Educators at Penn",
    "explanation": "Aspiring Educators at Penn is a community of undergraduate students interested in K-12 education. We provide mentorship opportunities, social events, and academic and career resources. The goal of Aspiring Educators at Penn is to connect undergraduate students interested in the field of education and to provide a space for students to explore careers in the field with a particular focus on the teaching profession.",
    "cleanedExplanation": "A community for Penn undergraduates focused on K-12 education, offering mentorship, social events, and resources for those exploring educational careers, especially in teaching."
  },
  {
    "name": "Assistive Devices and Prosthetic Technologies (ADAPT)",
    "explanation": "Penn Assistive Devices and Prosthetic Technologies (ADAPT) is a group of students at the University of Pennsylvania who are passionate about assistive and rehabilitative technologies. With a range of backgrounds and skills, we work to design, build and improve assistive devices for individuals living with disabilities, including cerebral palsy and limb loss. We aim to apply the skills we learn at Penn from many disciplines, such as engineering and business, to create impactful projects that engage outside communities.",
    "cleanedExplanation": "A student group at Penn passionate about creating assistive and rehabilitative technologies for people with disabilities. Members from various disciplines collaborate on designing and improving these technologies."
  },
  {
    "name": "Association for Women in Math",
    "explanation": "The University of Pennsylvania Chapter of the Association for Women in Mathematics is an active student-run organization full of math, enthusiasm, outreach and support. \n\nOur Mission: We are a student-run chapter that is organized and will be operated for educational and scientific purposes to promote the following: \n\nan increased knowledge of and greater interest in the mathematical sciences, including pure and applied mathematics, statistics, and their applications; \na greater understanding of the contributions of women in the mathematical sciences; and\nmentoring and encouraging women and girls as they prepare for careers in the mathematical sciences.",
    "cleanedExplanation": "A student organization promoting knowledge and interest in mathematical sciences. It focuses on increasing awareness of women's contributions in math and supports women and girls preparing for mathematical careers."
  }
  ,
  {
    "name": "Biomedical Engineering Society",
    "explanation": "The Biomedical Engineering Society (BMES) is the undergraduate professional society for the bioengineering department. We serve as a liaison between the faculty and the students, organize social events for BE students to find community outside of the classroom, and host career and networking events.",
    "cleanedExplanation": "An undergraduate society for bioengineering students at Penn, facilitating interaction with faculty, organizing social and professional events, and fostering a community outside the classroom."
  },
  {
    "name": "Black Pre-Law Association",
    "explanation": "The Black Pre-Law Association is a student group at The University of Pennsylvania that aims to provide those with law school aspirations with encouragement, motivation, and access to the multiple resources that will establish them as competitive candidates for law school. It hopes to educate members on current legal matters and trends so as to improve understanding of the field of law and inform the choice to enter a corresponding line of work. BPLA facilitates networking and mentorship opportunities that create supportive and information-sharing relationships with other law professionals that are underrepresented minorities.",
    "cleanedExplanation": "A group supporting Penn students aspiring to law school with resources, education on legal trends, and networking, focusing on underrepresented minorities in the legal profession."
  },
  {
    "name": "Black Wharton Undergraduate\nAssociation",
    "explanation": "Black Wharton Undergraduate Association (BW) is a student-run organization dedicated to enhancing the collegiate experience and accelerating the professional aspirations of our members. In order to meet these goals, BW provides its members with internship information, interactive business conferences, community service opportunities, and alumni networking among other initiatives. BW holds monthly general body meetings (GBMs) to foster community and professionally develop members of the Black Penn community. BW is composed of high-potential students whose interests vary across numerous industries. Our organization serves as an intermediary between our diverse corporate sponsors and our members as well as a support system for our members’ academic, personal, and pre-professional endeavours.",
    "cleanedExplanation": "A student organization at Penn enhancing collegiate and professional experiences for Black students, offering internships, conferences, community service, and networking opportunities."
  },
  {
    "name": "BlackGen Capital",
    "explanation": "The BlackGen Capital chapter at the University of Pennsylvania serves to provide valuable hands-on experience to minorities who have historically been underrepresented in the financial services industry. These underrepresented minorities are students that identify as Black/African-American, Hispanic, or Native American. The purpose of BlackGen Capital at the University of Pennsylvania is to break down barriers that have prohibited underrepresented minorities from pursuing successful careers in finance and business by creating an environment where like-minded individuals can learn from & network with each other, and by providing effective educational resources that can be leveraged at any time. Our focus is to not only cater to students who already have exposure to this industry but to also attract students who do not have any experience with finance and are highly interested in learning more.",
    "cleanedExplanation": "A chapter dedicated to providing financial industry experience and breaking barriers for underrepresented minorities at Penn, offering networking and educational resources in finance and business."
  },
  {
    "name": "\nCollegium Institute Student Association at Penn",
    "explanation": "Collegium Institute Student Association at Penn is a student group at the University of Pennsylvania, working as a part of the Collegium Institute. Collegium Institute is a vibrant intellectual community of students and faculty interested in the interdisciplinary, humanistic, and communal pursuit of knowledge. We offer seminars, fellowships, special events, and other programs designed to enrich academic culture by drawing from the Catholic intellectual tradition and the liberal arts tradition of humane studies more broadly. Our members represent a variety of academic disciplines. Some are religious—many are not. All are interested in exploring “catholic,” or universal, questions and engaging in rich, cross-disciplinary conversations. While the Collegium community includes Undergraduate Fellows, Graduate Fellows, and Faculty Fellows, you don’t need to be an official Fellow to participate in our programs.",
    "cleanedExplanation": "A group at Penn part of the Collegium Institute, fostering an intellectual community with seminars and events rooted in Catholic and liberal arts traditions, open to students of all disciplines."
  },
  {
    "name": "Common Cents",
    "explanation": "Common Cents is a student organization at the University of Pennsylvania and a national nonprofit seeking to empower college & underserved high school students with the knowledge to manage their money and reach financial independence. Our committees work together to hold events and workshops and create educational resources tailored to high school and college students.",
    "cleanedExplanation": "A student group and national nonprofit at Penn focused on financial education for college and high school students, offering workshops and resources for financial independence."
  },
  {
    "name": "Consult for America",
    "explanation": "We are Consult for America (CFA), a student group at the University of Pennsylvania committed to helping both local entrepreneurs and students reach their maximum business and professional potential. We offering pro-bono consulting services to small businesses, startups, and nonprofits in Philadelphia, and we provide Penn students with the opportunity to cultivate their consulting skills and deepen their community involvement.",
    "cleanedExplanation": "A Penn student group offering pro-bono consulting to local businesses and nonprofits, helping students develop consulting skills and engage with the community."
  },
  {
    "name": "Dell Women's Entrepreneur Network @ Penn",
    "explanation": "We are a University of Pennsylvania student club endorsed by Dell Women's Entrepreneur Network, a global network of women entrepreneurs established by Dell Technologies in 2009. A gateway to become involved with DWEN's Next Gen Group. DWEN@Penn is the exclusive on-campus liaison and coordinator for DWEN and Dell-sponsored events including recruiting, seminars, mentorship, etc. Founder of DWEN@Penn is a Next Gen Leader (18-30) of DWEN Global. All graduate and undergraduate members of the Penn Community are welcome!",
    "cleanedExplanation": "A Penn student club collaborating with Dell Women's Entrepreneur Network to provide networking, seminars, and mentorship for women entrepreneurs. Open to all graduate and undergraduate students."
  },
  {
    "name": "DiversaTech Penn",
    "explanation": "DiversaTech is Penn’s first student-run technology consultancy. Diversatech was created with the mission of exposing students of all backgrounds to tech, combining design, engineering & business principles to create novel, dynamic & impactful recommendations. With a longstanding chapter at UC Berkeley, we have worked for companies such as Coinbase, Snapchat, AirBnB, Twitter, Quizlet & Ebay, among others. We partner with clients from a variety of tech industries and form interdisciplinary teams to tackle projects including but not limited to strategy, app development, marketing & feature design. We strongly believe that the best solutions arise from bringing together individuals of all backgrounds & thus no technical or consulting experience necessary - diversity, community & zeal comprise our core values, thus all majors are welcome to apply. Be a part of DiversaTech Penn, expand your network across universities and gain hands-on tech-specific experience!",
    "cleanedExplanation": "Penn’s first student-run technology consultancy, fostering a diverse community in tech with projects in strategy, app development, and marketing. Open to all majors, emphasizing the value of diverse backgrounds."
  },
  {
    "name": "Engineering Consultants at Penn",
    "explanation": "In 2022, 33% of Penn Engineering graduates' first destinations were in the financial services and consulting industries. But along the way, besides students participating in the Engineering Entrepreneurship Minor or Wharton Dual Degree, there are few specific ways for engineers to get involved with such industries while at Penn.\n\nThat is why we founded Engineering Consultants at Penn (ECP)!\n\nECP is Penn’s first club focused on creating consulting and business opportunities, particularly within the scientific and engineering industries. With 8 teams distinguished by 8 departments of Penn Engineering, ECP offers consulting engagements that reach across all scientific disciplines. Whether you are a Penn Engineer looking to enter these industries, a Wharton student hoping to gain more experience in the intersection of business and science, or a CAS or Nursing student interested in any of these fields, ECP welcomes you to join our community of change-makers!",
    "cleanedExplanation": "A Penn club providing consulting and business opportunities in engineering and science. Open to students from various disciplines, ECP encourages involvement in diverse consulting projects."
  },
  {
    "name": "Global Research and Consulting",
    "explanation": "GRC Wharton is a student group at the University of Pennsylvania and the founding branch of GRC Group, a global network of independently operated consulting groups around the world with branches at elite institutions such as Columbia, Harvard, Stanford, and Kellogg. \nOur Mission \n“To bring together the most talented, passionate, and diverse students from around the world and empower them to make an impact on the work of our NGO and social impact partners.\"",
    "cleanedExplanation": "A Penn student group and part of a global network focused on empowering diverse students to impact NGOs and social causes through consulting. Collaborates with top institutions worldwide."
  },
  {
    "name": "GlobeMed at Penn",
    "explanation": "GlobeMed is a network of university students passionate about global health and social justice, who work to improve the health of those living in poverty by forming multi-year partnerships with grassroots organizations across the globe. At the University of Pennsylvania, we bring the GlobeMed model of sustainable partnership and peer education to our members, our campus, and our local and global communities through issue-based awareness campaigns, fundraisers for our partner organization, local engagement and volunteering, and global health- and social justice-related speakers and panels.",
    "cleanedExplanation": "A University of Pennsylvania student group dedicated to global health and social justice. It partners with global grassroots organizations and engages in activities like campaigns, fundraising, and events focused on health and justice."
  },
  {
    "name": "Google Developer Student Club @\nPenn",
    "explanation": "We are the University of Pennsylvania chapter of a global network of Google Developer Student Clubs (GDSC) powered by Google. GDSCs are university based community groups for students interested in Google developer technologies. Students from all undergraduate or graduate programs with an interest in growing as a developer are welcome. By joining a GDSC, students grow their knowledge in a peer-to-peer learning environment and build solutions for local businesses and their community.\n\nGDSC@Penn's mission is to help students identify relevant, forward-looking objectives, solve live problems, learn a wide range of technical tools, bridge the gap between theory vs. practice, while meeting other members to create teams with comparable goals. We will be holding technical workshops on a variety of topics, creating partnerships with other leading campus student clubs, and broadening the horizons of members.\n\nGoogle's mission statement is “to organize the world's information and make it universally accessible and useful.” We encourage universal ESG and DEI values in full compliance with Google's mission, especially when dealing with cutting-edge tools such as AI-driven solutions.",
    "cleanedExplanation": "A chapter of the global Google Developer Student Clubs network at the University of Pennsylvania, focusing on student growth in Google technologies through peer learning, projects, and workshops. It aligns with Google's mission, emphasizing ESG and DEI values."
  },
  {
    "name": "HOSA @ Penn",
    "explanation": "Penn is finally reactivating its HOSA chapter, and we invite you to join our student group at Penn! Over the coming months and years, we strive to provide our members with healthcare scholarship opportunities, fellowship and internship opportunities with our partners (ranging from Pfizer to the American Red Cross), and competitive events. Fill out the interest form to get involved and join the HOSA family!",
    "cleanedExplanation": "The Penn chapter of HOSA, reactivated to provide members with healthcare-related opportunities such as scholarships, internships, and competitive events."
  },
  {
    "name": "iDev",
    "explanation": "iDev is a student group at the University of Pennsylvania that aims to provide Penn students exposure to the field of international development through a variety of professional lenses and nurture a network dedicated to global impact.\n\nThe organization creates a space for discussion, professional guidance, and learning projects across several international development topic areas (economic, political, social, environmental) and different career paths (think tanks, government, business, NGOs).",
    "cleanedExplanation": "A student group at Penn focusing on international development. It provides a platform for discussion, professional guidance, and projects across various sectors like economy, politics, and environment."
  },
  {
    "name": "In Transcription",
    "explanation": "In Transcription (InT) @ Penn is one of the founding branches of InT, a global association for future scientists and entrepreneurs around the world with eleven other branches at elite institutions such as Columbia, John Hopkins, UChicago, and Cornell. Since 2021, the Penn branch has 30 current members.\n\nInT aims to promote the growth of future scientists and entrepreneurs in the life sciences by equipping them with the skills and resources to translate research into businesses. We seek to bring together undergraduate and graduate students who share a passion for biotechnology and healthcare, with the interest to pursue academia, industry, or entrepreneurship.\n\nAs a club, we hope to provide a great sense of community among our general and cohort members. We will present open-to-all speaker events with renowned researchers, case study workshops on emerging startups, and social events with other branches. Join us for discussions, mentorship, and workshops given by researchers, graduate students, and peers from other top universities",
    "cleanedExplanation": "A branch of the global association In Transcription at Penn, focusing on nurturing future scientists and entrepreneurs in life sciences. Offers speaker events, workshops, and community building activities."
  },
  {
    "name": "International Affairs Association",
    "explanation": "The International Affairs Association is a student group that strives to stimulate interest in international affairs among the students and community of the University of Pennsylvania. Comprised of six branches with over 100 students from all different majors, years, and backgrounds, the IAA is one of the largest student groups at the University of Pennsylvania.\n\nEvery year, the IAA hosts a Model UN Conference, participates in Model UN competitions across the country, sponsors community service events, hosts speakers, and publishes a series of blogs on international affairs. To learn more about the IAA branches and how you can get involved in our tight-knit community, visit our website.\n\nVisit https://linktr.ee/penniaa to learn more.",
    "cleanedExplanation": "A major Penn student group engaging in international affairs. It hosts a Model UN, participates in competitions, organizes community service, and publishes on global topics."
  },
  {
    "name": "\nInternational Relations Undergraduate Student Association",
    "explanation": "Membership in Sigma Iota Rho is intended not only to enhance the credentials of its members, though public recognition of the best and the brightest students in international studies is one of our main purposes, but is meant to encourage a life-long devotion to a better understanding of the world we live in and to continuing support for and engagement in education, service, and occupational activities that reflect the mission of Sigma Iota Rho.  In that way we do not limit ourselves to once-a-year pats on the back during the induction of new members, but internalize the belief that our purpose for studying international affairs is not only to position ourselves to succeed in a globalized society, but to make the world we live in a better place through our contributions in our work and day-to-day life.",
    "cleanedExplanation": "An association at Penn that encourages deep understanding and lifelong engagement in international studies. It focuses on education, service, and activities aligned with Sigma Iota Rho's mission."
  },
  {
    "name": "Jewish Executive Track",
    "explanation": "JET is a student-run business ethics fellowship. Through hosted speaker events and seminars, we provide Jewish students with opportunities to hear from successful business leaders who share stories about their experiences in the business world and take the students through a business ethics lesson. ",
    "cleanedExplanation": "A business ethics fellowship at Penn, offering Jewish students speaker events and seminars with business leaders, focusing on ethical practices in business."
  },
  {
    "name": "JHealth",
    "explanation": "The Penn Chapter of Olami’s Pre-Health Society is a community of Jewish Undergraduate Pre-Health students, offering career development opportunities so that students can stand out in their respective health fields. We offer access to mentorships, internships, research, graduate school resources, programming, community service, and social events. Open to pre- Medicine, -Dental, -Vet, -OT, -PT, -SLP, Psych, Nursing, Nutrition, Public Health students, and more.",
    "cleanedExplanation": "A community for Jewish Pre-Health students at Penn, providing career development opportunities, mentorships, internships, and various health-related events and services."
  },
  {
    "name": "JTech at Penn",
    "explanation": "The Penn Chapter of Olami's network for students looking to enter the field of tech",
    "cleanedExplanation": "A Penn chapter of Olami's network, focused on supporting students entering the tech field."
  },
  {
    "name": "Korea-Penn Engineers and Scientists Assocation",
    "explanation": "Korea Penn Engineers and Scientists Association (K-PEnSA) is an organization to address the unique cultural and academic needs of the university’s Korean students in disciplines of engineering and sciences and promote exchange of professional information and experience to help their career development, growth, and success.",
    "cleanedExplanation": "An association at Penn for Korean students in engineering and sciences, aiming to address cultural and academic needs and promote professional development and exchange."
  },
  {
    "name": "Locust Bioventures",
    "explanation": "We are a student group at the University of Pennsylvania that helps to create biotech startups by providing Penn research teams with strategic guidance and business materials to turn their scientific discovery into a biotech company.\n\nIn the past, we have worked with novel therapeutics and drug delivery platforms coming out of the labs of Dr. Carl June, Dr. Drew Weissman, Dr. Mark Sellmeyer, Dr. Robert Mach, and more.",
    "cleanedExplanation": "A Penn student group that aids in creating biotech startups, offering strategic guidance and business support to turn scientific discoveries into companies."
  },
  {
    "name": "Locust Health Connect",
    "explanation": "Locust Health Connect is the Penn chapter of the Ivy League+ Pre Health Society, a multi-university organization that connects pre-health students across universities to foster collaboration and growth. We provide professional development opportunities for students to gain hands-on skills, meet new people, and learn from leaders in healthcare. Some of our events have featured state surgeon generals, White House pandemic experts, and pharmaceutical executives. We will host renowned physicians, health policy leaders, and admissions experts in 2023. We will also collaborate with local healthcare institutions to volunteer in the West Philadelphia community. Some perks of joining our organization include a 50% discount on MCAT prep courses and mentorship for MCAT, application prep, and navigating life as a pre-health student. We also provide opportunities for students to write op-eds and podcast episodes (publicized on Spotify, iTunes, and Google Podcasts) about health-related topics.",
    "cleanedExplanation": "A multi-university organization connecting pre-health students, offering professional development, access to healthcare leaders, and opportunities for volunteering and mentorship."
  },
  {
    "name": "Machine Learning Research at Penn",
    "explanation": "The Machine Learning Research at Penn (MLR @ Penn) group is designed for undergraduate students to cultivate their passion in Machine Learning (ML) and Artificial Intelligence (AI) research. We facilitate conversations about recent works in topics of interest through reading groups, and encourage students to collaborate and engage in developing novel research, with possible opportunities for publication.",
    "cleanedExplanation": "A group for undergraduates interested in Machine Learning and AI research, fostering collaboration and novel research opportunities."
  },
  {
    "name": "Medical Interpreters @ Penn",
    "explanation": "We are a multi-lingual student organization at the University of Pennsylvania. We help Penn students become cultural advocates and interpreters at various clinics in Philadelphia by coordinating translator training and placement. MI@P aims to help improve patients' quality of life by promoting equal access to healthcare regardless of one's socioeconomic and cultural background. We acknowledge and work our hardest to minimize the challenges that come with limited English proficiency.",
    "cleanedExplanation": "A student organization focused on training medical interpreters to promote equal healthcare access."
  },
  {
    "name": "National Society of Black Engineers",
    "explanation": "NSBE is a student group at the University of Pennsylvania. It is a national organization, broken into different regions, composed of individual collegiate chapters. Although our primary goals revolve around academic excellence, professional development, and community service, we hold many social events that foster and strengthen our tight-knit community. If you are looking to be a part of a family away from home, join ours.",
    "cleanedExplanation": "A student group focused on academic excellence, professional development, and community service, with a welcoming and tight-knit community."
  },
  {
    "name": "Penn Astronomical Student Association",
    "explanation": "Our goal is to create a community of students at the University of Pennsylvania from all majors and backgrounds who are interested in astronomy, science fiction, and everything in between. We host weekly events, like trivia nights and space-themed discussions! Click this link to view our slideshow that provides a club overview! You can also sign up for our listserv here.",
    "cleanedExplanation": "A community for students interested in astronomy and science fiction, hosting regular events and discussions."
  },
  {
    "name": "Penn Climate Ventures",
    "explanation": "We're a student-run organization dedicated to building out Penn's climate innovation ecosystem. PCV aims to create a professional pipeline on par with consulting, finance, and tech — but specifically for climate! We are composed of students ranging from all 4 years AND grad students, all with an interest in exploring climate. All majors are welcome, and we do not require any prior experience!",
    "cleanedExplanation": "A student-run organization focused on building Penn's climate innovation ecosystem, welcoming students from all majors."
  },
  {
    "name": "Penn Computer Science Society",
    "explanation": "The Computer Science Society is the University of Pennsylvania's computer science student organization. We look to build a community within computer science, and we work to provide students with as many opportunities as we can. Whether we're planning late night cookies, interview prep panels, or hackjams, we're always looking to help out the students and to promote the department.",
    "cleanedExplanation": "The computer science student organization at Penn, fostering a community and providing opportunities for students."
  },
  {
    "name": "Penn Impact Investing",
    "explanation": "Penn Impact Investing (PII) is a student group at Penn that aims to connect students with real world opportunities and thought leadership in impact investing. PII hosts speaker events and supports impact investing funds with pro-bono services. \npennimpactinvesting.org",
    "cleanedExplanation": "A student group connecting students with impact investing opportunities and thought leadership."
  },
  {
    "name": "Penn in Washington",
    "explanation": "The official student organization of the Penn in Washington (PIW) program. We are an informal community of people with shared passions in service, public policy, politics, and more - anything that makes us aspire to study in DC! If you're interested in going to DC through PIW, this is your starting line. The point is to chill and make friends!",
    "cleanedExplanation": "The student organization of the Penn in Washington program, focused on service, public policy, politics, and building a community."
  },
  {
    "name": "Penn Infectious Disease Club",
    "explanation": "The aim of this club is to serve as a forum for students interested in infectious diseases (ID) to come together to discuss advancements in the field, interact with core ID researchers, and volunteer for disease containment events on campus and in the wide Philadelphia community. This club also provides opportunities for academic and professional mentorship between graduate students at the Perelman School of Medicine and Penn students. Our events include journal club-style meetings during which group members either present an influential ID paper or their own research projects, social activities (e.g., ID-themed movies nights, art & crafts nights), guest lectures by Penn professors and researchers involved with ID, and volunteer/fundraising opportunities. Our aim is for the peer-to-peer and peer-to-faculty learning stimulated by this club to inspire the next generation of ID researchers and/or enthusiasts.",
    "cleanedExplanation": "A club for students interested in infectious diseases, offering discussions, interactions with researchers, and volunteer opportunities."
  },
  {
    "name": "Penn Innovation Network",
    "explanation": "The First ESG innovation-driven club at the University of Pennsylvania that elevates training opportunities and career accessibility and exposure to multiple verticals, such as ESG financing solutions, socially innovative ventures, and cutting-edge ESG tech and media creations. \n\nPIN claims innovative global ESG majors as its corporate sponsors and partners. Exclusive corporate sponsors include Siemens, Bose and MSCI. Corporate partners include industry-leading Soros Fund Management, Point72 Asset Management and Paramount Global, with more to come.\n\nPIN executive board comprises of graduate and undergraduate talents hailing from the College, SEAS and Wharton. They bring professional experiences at Soros, McKinsey, BCG, Oracle, SAP, NASA, AstraZeneca, Tishman Speyer, MSCI, etc., and are passionate about a future convergence of tech and finance sharing common ESG values. Via a triumvirate 3-club model with Google DSC@Penn and Dell Women Entrepreneur Network@Penn, PIN aims to create value-accretive, win-win-win propositions for members, sponsors and Penn.\n\nCriteria for membership are genuine zeal for ESG tech/finance and social innovation, and demonstrated academic interests in relevant fields. PIN welcomes both undergraduate and graduate students to our membership. Recruiting for executive board positions will commence January 2023.",
    "cleanedExplanation": "A club focused on ESG innovation, connecting students with opportunities and partners in various verticals."
  },
  {
    "name": "Penn Innovators in Business (PIIB)",
    "explanation": "We are Penn Innovators in Business (PIIB), a Penn student group that connects the brightest minds in different industries to provide insights and advice geared towards fellow undergraduates looking to venture into similar fields. In the past, we have interviewed John Steinberg (former BuzzFeed President), Joey Zwillinger (CEO of Allbirds), Ethan Brown (CEO of Beyond Meat), and more.\n\nWe strongly believe that one-on-one interactions and interviews are the best way to learn from others so we focus on creating top-notch interviews to provide an opportunity for the students to learn first-hand from our guests. Recently, we have partnered with Zoom Memes for Self Quaranteens, a 800k+ member Facebook group, to bring live-streamed interviews focusing on professional career growth. We also work in partnership with Wharton Executive Education to run a mentorship program every year. To be notified of our events and interview content, sign up for the listserv here. We're always looking for new innovators, so apply here by January 27th to see if you'd be a good fit for the team.",
    "cleanedExplanation": "A group connecting students with industry leaders through interviews and mentorship, focusing on professional career growth."
  },
  {
    "name": "Penn International Impact Consulting - PIIC",
    "explanation": "Penn International Impact Consulting is the oldest student-run consultancy at Penn providing pro-bono consulting services to NGOs and social entrepreneurs worldwide. We are composed of some of the brightest and most passionate globally-minded students from all four schools at the University of Pennsylvania.\n\nPIIC is committed to empowering NGOs and social entrepreneurs in developing regions through meaningful work and international on-site engagements that make it unique to Penn’s community.",
    "cleanedExplanation": "A student-run consultancy providing pro-bono consulting services to NGOs and social entrepreneurs worldwide."
  },
  {
    "name": "Bent Button Productions",
    "explanation": "We write, shoot, direct, edit, and sometimes act in the films to create an interactive, hands-on learning experience. All the members love entertainment, and we want to share our enthusiasm with others.",
    "cleanedExplanation": "A group focused on creating films and providing a hands-on learning experience in entertainment."
  },
  {
    "name": "Penn Latin and Ballroom Dance (PLBD)",
    "explanation": "We are a Student organization at the University of Pennsylvania. Our goal is to teach and promote Latin and Ballroom dance to students, faculty, staff, and members of the Philadelphia community. No partner needed. We welcome beginners! In fact, most students currently on the team had no prior dance experience. We compete at collegiate competitions in the Northeast and put together performances throughout the year.",
    "cleanedExplanation": "A student organization teaching and promoting Latin and Ballroom dance to all, with no partner needed."
  },
  {
    "name": "Penn Aerial Robotics",
    "explanation": "Penn Aerial Robotics (Penn AiR) is student-led team for the development of unmanned aerial vehicles (UAVs) and robots. The club aims to provide students with the resources to construct, develop and test their own UAVs, travel to and compete at inter-collegiate competitions, and to connect with people who share this same passion. For the 2023 season, we will be building two aircraft to compete at SAE Aero Design East in March/April 2024.",
    "cleanedExplanation": "A student-led team focused on developing unmanned aerial vehicles and robots, offering resources and competition opportunities."
  },
  {
    "name": "Penn Aerospace Club",
    "explanation": "PAC is a student group at the University of Pennsylvania that inspires Penn students to overcome the impossible. It is one of the most dynamic, fastest growing, and visible student groups in the University. PAC offers students a hands-on project oriented experience and guides them towards aerospace technology innovation. \n\nThe club is divided into four sub-teams: Rocket, Balloon, Aircraft, and Jet Propulsion. Each team strives to achieve excellence in its technical projects, collaborative work, and community events.\n\nAs the primary aerospace-focused group on campus, PAC is comprised of the best aerospace talent Penn has to offer. We serve a wide audience, with over 100 members, and the club continues to grow every semester with new recruits. Applications to Subteams are open at the beginning of Fall and Spring semester. Check the website page to see if the current semester's application is available!",
    "cleanedExplanation": "A student group inspiring aerospace technology innovation with hands-on projects and sub-teams."
  },
  {
    "name": "Penn Baking Club",
    "explanation": "Penn Baking Club is a student group at the University of Pennsylvania. Our mission is to foster a community of students who enjoy baking and want to share/learn new recipes and techniques. Whether you have been baking for years or just like to eat cookies, this club is open to everyone at all experience levels. Our aim is to not only have fun while baking some really delicious food, but to also learn about the history and science of baking, as well as share our baked goods with the greater Penn and Philly communities.",
    "cleanedExplanation": "A student group fostering a baking community and sharing recipes, techniques, and baked goods."
  },
  {
    "name": "Penn Chess Club",
    "explanation": "The student chess group for the University of Pennsylvania, open to players of all skill levels! We want to engage the Penn community through chess. We meet Wednesdays at 8pm at Houston Hall!",
    "cleanedExplanation": "A chess club open to all skill levels, engaging the Penn community through chess."
  },
  {
    "name": "Penn Debate Society",
    "explanation": "As a student group at the University of Pennsylvania, we field teams to over fifteen tournaments per semester, including the World University Debate Championships and topping off our season in the spring with the National Tournament. In addition to competing, we also host college and high school debate tournaments that attract hundreds of debaters from universities and high schools across the nation. Over the course of the year, we have accumulated several accolades including: top speaker awards, top novice and varsity team finishes, and multiple national qualifiers.",
    "cleanedExplanation": "A student group at the University of Pennsylvania that participates in debate tournaments, hosts debate tournaments, and has received various accolades."
  },
  {
    "name": "Penn Electric Racing",
    "explanation": "Penn Electric Racing (PER) is the University of Pennsylvania’s Formula Electric SAE Team. We built America’s fastest student-designed racecar with a 0-60 time of 2.6 seconds—acceleration faster than freefall.\n\nWe have been affiliated with Formula SAE for nearly a decade, and in the process we have become one of North America's premier teams, garnering 39 trophies. Most recently, we obtained 4th in Skidpad and 6th in Autocross out of over 70 teams at FSAE Michigan 2023.",
    "cleanedExplanation": "Penn Electric Racing (PER) is the University of Pennsylvania’s Formula Electric SAE Team known for building a fast student-designed racecar."
  },
  {
    "name": "Penn Math Contest Club",
    "explanation": "This undergraduate and graduate club is dedicated to hosting and organizing the annual University of Pennsylvania Math Contest for high school participants. Our student group is focused on expanding mathematical outreach and stoking high school students' interest in math. There are many positions that don't require mathematical knowledge, such as social media, finances, logistics, day-of volunteering, etc. Please feel free to reach out to us with questions and for more information on how to get involved!\n\nOur club is dedicated to spreading mathematical passion to students of all levels. As such, last year, we ran both a beginners contest and an advanced contest in order to reach a greater audience of students. We included diverse mathematical problems from high school algebra to geometry to combinatorics to logic and other fields, and we are always welcoming more ideas about how the contest should be run, in order to make the contest appealling and exciting for students!",
    "cleanedExplanation": "A club at the University of Pennsylvania dedicated to hosting and organizing the annual math contest for high school students, with a focus on spreading mathematical passion to students of all levels."
  },
  {
    "name": "Penn Mock Trial",
    "explanation": "Penn Mock Trial is a student group at the University of Pennsylvania - and the school's one and only competitive mock trial program! Since the 1970s, the Penn Mock Trial team has traveled around the country to compete in some of the most prestigious tournaments—providing outlets for future lawyers, actors, debaters, and public speakers to refine their craft.\n\nMock trial refers to the act of simulating a trial. It is often conducted by students in order to understand trial rules and processes in a trial. A mock trial will simulate lower-court trials, conducting all the procedures of an original trial in an abbreviated form.\n\nIt’s a mix of public speaking, acting and debating. It’s having the skill to take the stand and be a ridiculous eye-witness, a grieving mother or a serious doctor. It’s dominating the courtroom and swaying an entire jury box to vote in your favor. It’s sharp suits, fiery rebuttals, and fast paced objection battles.",
    "cleanedExplanation": "Penn Mock Trial is the University of Pennsylvania's competitive mock trial program, providing opportunities for students to simulate trials and develop skills in public speaking, acting, and debating."
  },
  {
    "name": "Penn Model Congress",
    "explanation": "Penn Model Congress, founded in 1997, is an entirely student-run organization open to all undergraduates of the University of Pennsylvania. Each spring, PennMC hosts an elite four-day conference for high school students from around the country to debate bills written by their peers covering a variety of contemporary political issues. Additionally, the club sponsors panels, guest speakers, and various other events in order to discuss and enhance our understanding of the United States government, particularly the Congress and legislative process.",
    "cleanedExplanation": "Penn Model Congress is a student-run organization at the University of Pennsylvania that hosts a conference for high school students to debate bills and learn about the United States government."
  },
  {
    "name": "Penn Quizbowl",
    "explanation": "We are a student group at the University of Pennsylvania that competes against other colleges in team-based quiz bowl competitions.",
    "cleanedExplanation": "A student group at the University of Pennsylvania that competes in team-based quiz bowl competitions against other colleges."
  },
  {
    "name": "Science Olympiad at Penn",
    "explanation": "Science Olympiad at the University of Pennsylvania (SOUP) is a student-run organization at Penn that hosts a Science Olympiad invitational tournament and mentors local middle school and high school teams in Philadelphia with the goal of spurring interest in STEM for students who might otherwise lack the opportunity.\n\nWhat is Science Olympiad?\nScience Olympiad is a non-profit organization that hosts official tournaments on a regional, state, and national level with around 7,800 teams of 15 students across all 50 states. These tournaments consist of 23 events that test students on a range of subjects, including biology, earth and space science, chemistry, and engineering.\n\nOur Purpose\nParticipating in high school and middle school Science Olympiad inspired many of our members to pursue degrees and careers in science, technology, engineering, and mathematics. Our organization’s mission is to provide young students in the Philadelphia area and around the country with the opportunity to experience Science Olympiad.",
    "cleanedExplanation": "Science Olympiad at the University of Pennsylvania (SOUP) is a student-run organization that hosts a Science Olympiad invitational tournament and mentors local middle and high school teams to spur interest in STEM."
  },
  {
    "name": "The Daily Pennsylvanian",
    "explanation": "The Daily Pennsylvanian is a student-run media organization with both editorial and business departments. The editorial side, operating remotely through the pandemic, includes departments like News, Sports, Opinion, Multimedia, Copy, Audience Engagement, Web Development, and Podcasts. The business side, a $3-million operation, consists of teams such as Marketing, Analytics, Product Lab, and Consulting, offering students a real-world business experience.\n\n34th Street Magazine serves as the authority on Penn student life, empowering student voices and covering arts and campus culture. It provides opportunities for creative expression in writing, marketing, design, photography, videography, and social media. Street aims to be a tight-knit community where individuals learn from dedicated peers.\n\nUnder the Button is Penn's humor and satire source, with a team of writers, videographers, actors, graphic designers, and coders. It covers unconventional stories with a humorous twist, and if you're a funny person looking to share your humor with the campus, Under the Button invites you to join their team.",
    "cleanedExplanation": "The Daily Pennsylvanian is a student-run media organization with editorial and business departments, including 34th Street Magazine and Under the Button, offering opportunities for creative expression and real-world business experience."
  },
  {
    "name": "Web3 Builders",
    "explanation": "Web3 Builders is a vibrant community of students exploring the technical side of crypto and blockchain. This is a club for physical and virtual gatherings that includes building, information sharing, education, career, and community events. We welcome both engineers and non-engineers who are willing to get their hands dirty and wish to shape the future of blockchain technology.",
    "cleanedExplanation": "Web3 Builders is a community of students exploring the technical side of crypto and blockchain, welcoming both engineers and non-engineers."
  },
  {
    "name": "Discentes",
    "explanation": "Discentes is Penn's undergraduate Classical Studies publication. We publish articles, translations, research papers, and artwork from undergraduates and graduates from universities around the world.",
    "cleanedExplanation": "Discentes is Penn's undergraduate Classical Studies publication that publishes articles, translations, research papers, and artwork from students worldwide."
  },
  {
    "name": "DoubleSpeak Translation Magazine",
    "explanation": "DoubleSpeak is the University of Pennsylvania's journal on and of translation, run by undergraduates at the university. It is one of the only university-based translation magazines in the United States. Here at DoubleSpeak, we strive to represent and celebrate a number of different languages, countries, and cultures by publishing interpretations of the work of poets and writers across centuries and around the world.",
    "cleanedExplanation": "DoubleSpeak is the University of Pennsylvania's translation magazine run by undergraduates, representing and celebrating different languages, countries, and cultures."
  },
  {
    "name": "F-Word Magazine",
    "explanation": "The F-Word is a collection of feminist voices that comes together in a biannual print publication, weekly discussion groups, and an online blog. We are a student-run publication at the University of Pennsylvania, and we aim to be a space for people of all backgrounds to talk, write, or create art through their experiences. We hope to represent and welcome many voices with meaningful thoughts to share: queer, POC, all genders, and all socioeconomic backgrounds. We hope to foster more thoughtful campus discussion on the bounds of and potential for feminism, intersectionality, social justice, and the role of publication and writing in all of the above.",
    "cleanedExplanation": "The F-Word is a feminist publication at the University of Pennsylvania that welcomes voices from all backgrounds to discuss and create art through their experiences."
  },
  {
    "name": "Fenjan: The Middle East Magazine",
    "explanation": "Founded in 2020, Fenjan is the University of Pennsylvania’s premier student-produced magazine on the Middle East. Through non-partisan, quarterly issues, Fenjan is dedicated to increasing empathy for and understanding of the Middle East among the Penn Community through written and visual work. Fenjan covers countries commonly recognized as part of the MENA region. We welcome people of every cultural identifier and background.",
    "cleanedExplanation": "Fenjan is a student-produced magazine at the University of Pennsylvania focused on the Middle East, aiming to increase empathy and understanding through written and visual work."
  },
  {
    "name": "La Vida Magazine",
    "explanation": "La Vida Magazine is the University of Pennsylvania's only student-run Latinx interest publication, established in 2001 as a short printed newsletter by the Cipactli Latino Honor Society. We publish a variety of submissions, including visual art, poetry, prose, and critical essays. We celebrate the diversity of Latinx culture, and as such we strive to acknowledge Latinx voices on campus. As of 2017, we have expanded submissions to the entire Ivy League.",
    "cleanedExplanation": "La Vida Magazine is Penn's student-run Latinx interest publication that celebrates Latinx culture through various submissions and expanded to the entire Ivy League in 2017."
  },
  {
    "name": "Penn Appétit",
    "explanation": "Penn Appétit is the University of Pennsylvania's innovative, student-run magazine covering all things food. Throughout the year, we publish eye-catching magazines, host events with high-profile restaurateurs, and trek through Philly and beyond for the greatest food finds. Find a place in our organization by becoming a writer, photographer, designer, or recipe developer! If you want more hands-on experiences, you can help us plan a new host of events, establish relations within the food industry, run our food blog, or volunteer directly in the Philly community, to name a few.",
    "cleanedExplanation": "Penn Appétit is a student-run magazine at the University of Pennsylvania covering all things food, offering opportunities for writers, photographers, designers, and more."
  },
  {
    "name": "Penn Bioethics Journal",
    "explanation": "Established in 2004, the Penn Bioethics Journal is the premier peer-reviewed undergraduate bioethics journal, hosted by the Department of Medical Ethics and Health Policy at the Perelman School of Medicine. Published papers are on a wide variety of topics, from neuroethics to xenotransplantation and everything in between. Our call for papers goes out to undergraduate and graduate students across the globe. The acceptance process is very competitive with submissions undergoing an initial review, a small-group review, and, if warranted a final review by the full editorial board of approximately 30 students.",
    "cleanedExplanation": "The Penn Bioethics Journal is the premier peer-reviewed undergraduate bioethics journal hosted by the Department of Medical Ethics and Health Policy at the Perelman School of Medicine."
  },
  {
    "name": "Penn Undergraduate Law Journal",
    "explanation": "A student-run research publication, the Penn Undergraduate Law Journal (PULJ) seeks to foster scholarly discourse on topical and historical issues pertaining to law or the legal system. In this spirit, the journal's principal objective is to publish exceptional undergraduate works, drawn from an array of disciplinary perspectives, that evaluate and elucidate the intricacies, vagaries, and nuances of law as they relate to domestic and international affairs, business, academia, and society. PULJ aims to sustain and enrich a vibrant discussion about law at the undergraduate level because it recognizes that the student writers of today will be the leaders, lawyers, and scholars of tomorrow.",
    "cleanedExplanation": "The Penn Undergraduate Law Journal (PULJ) is a student-run research publication that fosters scholarly discourse on legal issues, publishing exceptional undergraduate works."
  },
  {
    "name": "PennScience Journal of Undergraduate Research",
    "explanation": "PennScience Journal of Undergraduate Research is a student group committed to promoting and raising the visibility of undergraduate research. Conducting research has become a standard part of many science majors' interests, and many students go above and beyond the call of the minimum requirements, spending long hours and summers in the lab. Some even begin their research careers while still in high school. Yet too often, this work goes unnoticed and unreported. By creating a scientific forum for and by students, we hope to bring together young researchers, helping to make students feel that rather than participating in a disjointed and isolating endeavor, they are becoming a part of a true community of scholars. We also seek to raise the awareness of the outside community to research performed by undergraduates. A key goal of our journal is to make publication more accessible to college students, providing a peer-reviewed journal dedicated solely to their work. Publication in academic journals is a time-consuming process which is not always suitable for the duration and scale of projects done by undergraduates; we seek to create another option will allow more students to publish their research.",
    "cleanedExplanation": "A student group promoting and raising the visibility of undergraduate research, creating a scientific forum for young researchers and making publication more accessible to college students."
  },
  {
    "name": "QUAKE Magazine",
    "explanation": "Quake magazine is a student-run publication that uses literature, photography, design, and other art forms to facilitate the appreciation of bodies, relationships, sex, and love of all kinds. We strive to explore these themes in a respectful, inclusive, and artful space which is welcoming to all identities. In seeking honest sharing, we value confidentiality above all else and will strive to be equitable and trustworthy in our appreciation for different stories.",
    "cleanedExplanation": "A student-run publication using art forms to explore themes related to bodies, relationships, and love in an inclusive and respectful manner."
  },
  {
    "name": "T-Art Magazine",
    "explanation": "T-art magazine exists at the intersection of art and technology to create a dialogue between the two seemingly disparate fields. By bridging the gap between artists and innovators within the Penn community and beyond, our publication explores the collaborative potential to push the boundaries of art and design. Our mission is to connect students and inspire them to develop their creative passions, as artists and designers have an important role in sparking new conversations and creating original works and products.",
    "cleanedExplanation": "A magazine at the intersection of art and technology, fostering collaboration between artists and innovators, and inspiring creative passions."
  },
  {
    "name": "The Penn Review Literary Magazine",
    "explanation": "Devoted to the literary and visual arts, we are a student group and a professional literary magazine that publishes original poetry, fiction, creative nonfiction, and visual artwork, and feature a blend of emerging and established voices in our biannual print and online publication. In our seven-decade history, we’ve published works by William Carlos Williams, Allen Ginsberg, e. e. cummings, and Jennifer Egan, among others. Sign up for our listserv here—https://forms.gle/LNiVSxQZdcPAHDc98—and join us for our weekly meetings at the Kelly Writers House, Room 202, Tuesdays from 9:00 PM to 10:00 PM. Also, join us at the Kelly Writers House activity fair on Friday, Sep. 1 from 1:00 PM to 3:30 PM to meet with current editorial staff and learn more about the magazine!",
    "cleanedExplanation": "A literary magazine publishing original works in poetry, fiction, nonfiction, and visual art, featuring both emerging and established voices."
  },
  {
    "name": "The Pennsylvania Punchbowl",
    "explanation": "Founded in 1899, The Pennsylvania Punch Bowl, a student-run publication, is the oldest and funniest humor magazine at the University of Pennsylvania. Our magazine publishes three print issues annually and new web content daily. We’re looking for students interested in one or more of the following areas: comedy/writing, graphic design, marketing, and video. No application or experience required! Just a sense of humor and/or a sigma-male red-pill mindset.",
    "cleanedExplanation": "The oldest humor magazine at the University of Pennsylvania, publishing print issues and web content, seeking students interested in comedy, design, marketing, and video."
  },
  {
    "name": "The WALK Magazine",
    "explanation": "Launched in 2006, The WALK Magazine is the University of Pennsylvania’s premier and completely student-run fashion publication and community. In 2010, thewalkmag.com was launched as a sister to the print edition, providing Penn with its widely-demanded fashion fix year round. As an organization, The WALK strives to explore the interdisciplinary field of fashion through its diverse and talented staff members. We at The WALK hope to not only cultivate a passionate community of creative thinkers but to universalize the powerful force of fashion—within and outside of Penn. We hope that, through our commitment to innovative thinking, we can inspire you to discover the wonderful world that is fashion.",
    "cleanedExplanation": "A student-run fashion publication and community exploring the interdisciplinary field of fashion, cultivating a passionate community of creative thinkers."
  },
  {
    "name": "UnEarthed Penn",
    "explanation": "UnEarthed is a student-run publication at the University of Pennsylvania that publishes creative, inspirational, and educational magazines for elementary and middle schoolers in the West Philadelphia area. Our mission is to ensure that every child has the opportunity to unearth their intellect and curiosity. Each semester, our team of writers, editors, and designers collaborates to create a magazine that we share with local children in person and online. Past articles include topics like the history of coffee, how different animals sleep, why hot water feels cold, and so much more!",
    "cleanedExplanation": "A student-run publication creating magazines for elementary and middle schoolers, inspiring intellectual curiosity."
  },
  {
    "name": "Wharton Undergraduate Media and Entertainment Club",
    "explanation": "UME is proud to be one of the largest student-led media & entertainment organizations at the University of Pennsylvania. We explore numerous channels of the M&E industry, including music, film, gaming, and television. We host numerous events and partner with a number of organizations on and off campus to bring the most thoughtful speakers, meaningful workshops, and professional networking sessions to our members. Through our conscientious and consistent efforts to maintain relationships with alumni and build new relationships with current members, we hope to bridge the gap between business and the vast and exciting world of media & entertainment.",
    "cleanedExplanation": "A student-led media & entertainment organization exploring various channels of the industry, hosting events, workshops, and networking sessions."
  },
  {
    "name": "Sports Analytics Group at Penn (PSAG)",
    "explanation": "Sports Analytics Group at Penn (PSAG) aims to foster a community of students passionate about sports analytics. We are a student group at the University of Pennsylvania currently focused most heavily on basketball but also perform analysis for baseball and football, and we are also looking into expanding towards Lacrosse and Strength & Conditioning. Our purpose is to give the teams a competitive advantage by providing the coaching staff with a statistical analysis of practices, their own teams, and/or their opponents. The coaching staff identifies areas on the basketball court they want to improve. Working with the coaches’ input, this group determines methods to quantify these areas. The group works throughout the week to present the data in a dashboard or presentation that is",
    "cleanedExplanation": "A student group passionate about sports analytics, providing statistical analysis for various sports teams to improve performance."
  },
  {
    "name": "Admissions Dean's Advisory Board",
    "explanation": "The University of Pennsylvania’s Admissions Dean Advisory Board is a student group that works to apply authentic and diverse student voices in the initiatives of Penn Admissions by collaborating with staff to create and execute tangible results.",
    "cleanedExplanation": "A student group collaborating with Penn Admissions to apply diverse student voices in initiatives."
  },
  {
    "name": "Engineering Deans' Advisory Board",
    "explanation": "EDAB is a student-run board that seeks to enhance the undergraduate experience by acting as a liaison between Penn Engineering students, faculty, and administration.\n\nEDAB meets weekly to research and develop initiatives and deliverables. These projects range from improving the social ambiance of Penn Engineering to understanding which processes lead students to take on extra degrees and minors. We then present our findings in bimonthly Deans’ meetings, in which we meet with Dean Kumar, Associate Dean Ghrist, Director of Student Life Sonya Gwak, Director of Comm. Joan Gocke, Director of Administrative Operations Chambrel Jones, CETS IT Senior Director Kris Varhaus, and other faculty from around the school.",
    "cleanedExplanation": "A student-run board enhancing the undergraduate experience for Penn Engineering students, conducting research and presenting findings to faculty and administration."
  },
  {
    "name": "Engineering Student Activities\nCouncil",
    "explanation": "ESAC is a student group at the University of Pennsylvania that coordinates the activities of the various undergraduate organizations and acts as a liaison between undergraduate engineering students, SEAS faculty, and administration. We are a group of student leaders committed to building a stronger undergraduate engineering community by supporting student clubs and organizations through advising and providing resources.",
    "cleanedExplanation": "A student group coordinating activities for undergraduate engineering organizations and building a stronger engineering community."
  },
  {
    "name": "Nominations and Elections Committee",
    "explanation": "As one of the six branches of Penn Student Government (PSG), the NEC strives to ensure undergraduates are adequately represented at all levels of the university. We fulfill this mission by running elections and enforcing university election codes for the elected branches of Penn Student Government, nominating students to Penn's twenty-seven university wide committees and the university's highest deliberative body, the University Council, and educating the student body about student government affairs.",
    "cleanedExplanation": "A branch of Penn Student Government working to ensure undergraduate representation through elections and nominations."
  },
  {
    "name": "Penn Traditions",
    "explanation": "Penn Traditions is a unique approach to student philanthropy and engagement education and programming, with the objective of creating student understanding and awareness of Penn's institutional mission, history, and traditions, the financing of higher education, University goals, and the role of alumni and students in the Penn community. Penn Traditions is comprised of three branches, all led by student leaders, and provides involvement opportunities for students of all class years!",
    "cleanedExplanation": "A program promoting student philanthropy and engagement, creating understanding of Penn's mission, history, and traditions."
  },
  {
    "name": "Social Planning and Events Committee (SPEC)",
    "explanation": "The Social Planning and Events Committee (SPEC) is one of the branch of student governance that is responsible for planning a variety of social events and traditions on campus. There are eight committees under SPEC: Concerts, Connaissance, Film, Jazz & Grooves, Pop Up, Sound, SPEC-TRUM, and Spring Fling (Daytime).\n\nIf you have a creative mind and a passion for uniting students with fun and innovative events, you should reach out to any committee or our executive board to join. There is no limit on the number of committees that you can join. No application or interview is needed for any of the committees. ",
    "cleanedExplanation": "A student governance branch responsible for planning social events and traditions on campus."
  },
  {
    "name": "SPEC Connaissance",
    "explanation": "SPEC Connaissance (also known as Conn) is the SPEC sub-committee tasked with bringing high-profile speakers to campus who challenge, educate, and entertain the student body. Past speakers include Laverne Cox, Trevor Noah, Spike Lee, and Hunter Schafer. SPEC Connaissance is a student group at the University of Pennsylvania.",
    "cleanedExplanation": "A sub-committee of SPEC bringing high-profile speakers to campus to challenge, educate, and entertain students."
  },
  {
    "name": "SPEC Film",
    "explanation": "SPEC Film Society is a student group at the University of Pennsylvania that hosts free advanced screenings of upcoming movies and screens recent releases at least twice per month. SPEC Film also has an annual speaker series, which in the past has featured famous actors, directors and producers such as Simu Liu, H. Jon Benjamin, Zach Braff, Jesse Tyler Ferguson, Joseph Gordon Levitt, Aaron Sorkin, Kenan Thompson, Michael Cera, Woody Harrelson, and others. ",
    "cleanedExplanation": "A student group hosting advanced movie screenings, recent releases, and an annual speaker series."
  },
  {
    "name": "SPEC Jazz & Grooves",
    "explanation": "Jazz & Grooves is a student group at the University of Pennsylvania that brings up-and-coming artists to Penn's campus throughout the year. Our shows are open to both Penn students and the local public. Past talent includes Faye Webster, Perfume Genius, Moses Sumney, 100 gecs, Eartheater, SiR, Choker, Omar Apollo, Tierra Whack, Smino, and EARTHGANG, among others.",
    "cleanedExplanation": "A student group bringing up-and-coming artists to campus and hosting shows open to both students and the local public."
  },
  {
    "name": "SPEC Pop Up",
    "explanation": "Mission: To plan and host a variety of free spontaneous giveaways, events, and activities throughout the year for students to enjoy a break from classes! We are a student-run committee within student government at the University of Pennsylvania.",
    "cleanedExplanation": "A student-run committee planning and hosting free spontaneous events for students."
  },
  {
    "name": "SPEC Sound",
    "explanation": "SPEC Sound provides, maintains and runs the technical equipment for events hosted by a variety of student organizations, including Management 100 teams, sororities and fraternities, bands, and other SPEC committees. SPEC Sound provides services to charity events free of charge. SPEC Sound covers a broad array of tech and production support in a variety of contexts. Paid position!!",
    "cleanedExplanation": "A group providing technical support and equipment for events hosted by student organizations."
  },
  {
    "name": "SPEC Spring Fling Daytime",
    "explanation": "Welcome to the Spring Fling Committee, a branch of the Social Planning and Events Committee (SPEC)! Since 1973, Spring Fling has been the ultimate student festival at Penn and is the largest student-run festival in the East Coast. Spring Fling spans over two days in April, with the concert taking place on Friday night (run by the SPEC Concerts committee) and the daytime festival taking place on Saturday (run by us)!\n\nAs part of the daytime festival, nearly 4,000 students enjoy free food, inflatables, merch, live performances by student groups, and much more on Penn Park!\n\nAs part of the Spring Fling committee, you will get the chance to be involved in the marketing, logistics, and sponsorship planning of the festival. No application need to be a part of the committee. To join, subscribe to our newsletter and attend our General Body Meetings.",
    "cleanedExplanation": "A committee organizing the Spring Fling festival, including the daytime festival with various activities."
  },
  {
    "name": "Student Committee on Undergraduate Education",
    "explanation": "The oldest branch of Penn Student Government, SCUE seeks to address any issue which affects undergraduate education or the intellectual atmosphere at Penn. We work to enhance and expand curricular opportunities, advising, academic options, and the overall quality of the undergraduate academic experience. We serve our duty in various roles: both as advocates for the student body and as advisors to the faculty and administration.",
    "cleanedExplanation": "The oldest branch of Penn Student Government addressing undergraduate education issues and enhancing the academic experience."
  },
  {
    "name": "Undergraduate Assembly",
    "explanation": "The Undergraduate Assembly (UA) is the elected, representative organization of undergraduates at Penn, charged with improving life for all students through funding, services, and advocacy.\nHow we work:\nWe lobby for tangible change at Penn based on student needs\nWe represent students to administrators and outsiders\nWe bring students from different groups and identities together (see UA Steering)\nWe provide services to improve student’s quality of life (see UA Services)\nWe fund the other branches of student government and, by extension, all student groups on campus (see Budget)",
    "cleanedExplanation": "The elected representative organization of undergraduates at Penn, working to improve student life and support student groups."
  },
  {
    "name": "Underrepresented Student Advisory Board in Engineering",
    "explanation": "USABE strives to create a welcoming, diverse and inclusive community among engineers through underrepresented student advocacy. This entails connecting, empowering, and amplifying the underrepresented voices throughout SEAS. In doing so, we aim to:\n\nFacilitate meaningful, actionable discourse around the collective experiences of our underrepresented engineers through surveys and town halls.\nProvide useful resources and programming centered around academic, personal, and professional development.\nPresent our findings to the Dean of Engineering and Office of Diversity, Equity, and Inclusion (ODEI) to express student sentiments and create opportunities for administration to further support the needs of underrepresented students and better promote diversity and inclusivity throughout SEAS.",
    "cleanedExplanation": "A group creating a welcoming and diverse community among engineers through underrepresented student advocacy."
  },
  {
    "name": "Wharton Dean's Undergraduate Advisory Board",
    "explanation": "The Wharton Dean's Undergraduate Advisory Board (WAB) is Wharton’s oldest student leadership organization. Our nearly 40 year legacy rests on the mission of enhancing the Wharton undergraduate academic experience. Board members have the opportunity to collaborate with the highest levels of Wharton’s leadership, leaders in various industries around the world, and the student body. By generating and implementing initiatives that have a positive impact on the learning environment, WAB makes it a priority to integrate student voices into the school we call home.",
    "cleanedExplanation": "Wharton's oldest student leadership organization enhancing the undergraduate academic experience and integrating student voices."
  },
  {
    "name": "Alloy Media",
    "explanation": "Alloy Media is a community-based student media group at the University of Pennsylvania that produces projects and events in film, fashion and photography. Executive members help facilitate and coordinate the creation of projects in their respective disciplines and source creatives for projects from our member base. General members can participate in the creation of Alloy projects as well as use the network to help source collaborators for their own projects. Alloy puts on brainstorming/collaboration events for its members and art events/shows for the Penn community. We work with the existing creative networks at Penn to amplify their goals while establishing a creative unit across campus.The purpose of each Alloy event is to foster togetherness through the sharing of art and elevate/support local causes in Philadelphia.",
    "cleanedExplanation": "A community-based student media group producing projects and events in film, fashion, and photography."
  },
  {
    "name": "Arts House Dance Company",
    "explanation": "Arts House Dance Company is a student-run dance company at the University of Pennsylvania that performs everything from contemporary to ballet to hip-hop. We're a group of dancers from every background you can think of— we can't wait to dance with you!",
    "cleanedExplanation": "A student-run dance company performing various dance styles from contemporary to hip-hop."
  },
  {
    "name": "Bloomers Comedy Troupe",
    "explanation": "Bloomers is Penn's sketch comedy group for ABCDs (anyone but cis dudes!). We write and produce sketch comedy both on stage and in the digital format.\n\nThe heart of Bloomers has long been its completely student-run productions. Currently, Bloomers shows are held in October and March. Our shows are composed of completely new material, written by each year’s group of Bloomers, and often have an overarching theme. Join any one of our 6 sections to help us create our shows!\n\nOur Cast choreographs, directs, and performs an original SNL-esque sketch comedy show each Fall and Spring. Band arranges and performs songs during the shows, as well as at outside formals and parties. Writing ideates our show concepts and digital content scripts from the ground up. Tech constructs immersive sets while managing light and sound design. Costumes designs all character attire from ‘Camp Counselor 2’ to a life-size Penn Quaker mascot costume. And Biz (Business) manages all things production - from finances to graphic design.",
    "cleanedExplanation": "Penn's sketch comedy group producing new material through student-run productions."
  },
  {
    "name": "CityStep",
    "explanation": "We are a student community service group at the University of Pennsylvania that teaches dance to students in West and South Philadelphia schools. We serve as role models and mentors for the kids, introducing them to dance as a creative outlet for self-expression and development. At the end of the year, we hold an annual show with our students to perform for their friends, family, and community supporters.",
    "cleanedExplanation": "A community service group teaching dance to students in Philadelphia schools and holding an annual show."
  },
  {
    "name": "Dischord A Cappella",
    "explanation": "Founded in 1998, Dischord is the University of Pennsylvania's premier Pop and R&B all gender A Cappella group. We are student run and perform one show per semester, in addition to a variety of outside gigs. We cover artists like The Weeknd, Lizzy McAlpine, Coldplay, Beyonce, Mariah Carey, Bruno Mars, and more. Although we are a singing group, we like to say that we are 49% music and 51% family!",
    "cleanedExplanation": "The University of Pennsylvania's premier Pop and R&B all-gender A Cappella group founded in 1998. We perform one show per semester, covering a variety of artists. More than a singing group, we are a close-knit family."
  },
  {
    "name": "Disney A Cappella",
    "explanation": "Disney A Cappella is a student organization at the University of Pennsylvania that seeks to spread happiness via Disney songs and service to the community. By performing at hospitals, schools for children, and throughout campus, Disney A Cappella embodies the Disney message in song.",
    "cleanedExplanation": "A student organization at the University of Pennsylvania dedicated to spreading happiness through Disney songs and community service."
  },
  {
    "name": "Freaks of The Beat",
    "explanation": "We are the only student group focused on breaking at the University of Pennsylvania. We believe that Hip-hop, Breaking/Bboying, and dance are something that can be shared by all. We seek to share this vision with the Penn and Philadelphia community by developing our members' individual skills through training, performing at on and off-campus events, and by entering competitions to represent the University of Pennsylvania.",
    "cleanedExplanation": "The only student group at the University of Pennsylvania focused on Hip-hop, Breaking/Bboying, and dance. We aim to share our passion with the Penn and Philadelphia community through training, performances, and competitions."
  },
  {
    "name": "Fuerza",
    "explanation": "Fuerza is Penn's first and only student-run Latinx music group. Founded in 2019, our mission is to provide a safe space for students at Penn and in the greater Philadelphia area to creatively explore Latinx culture through musical performance. We are Latinx inspired, not Latinx exclusive.",
    "cleanedExplanation": "Penn's first and only student-run Latinx music group, founded in 2019. Our mission is to provide a safe space for students to explore Latinx culture through music."
  },
  {
    "name": "Full Measure",
    "explanation": "Full Measure is the University of Pennsylvania's only Christian a cappella student group. Our name comes from Ephesians 3:16-19...",
    "cleanedExplanation": "The University of Pennsylvania's only Christian a cappella student group with a name inspired by Ephesians 3:16-19. We aim to serve the community and share the gospel through music."
  },
  {
    "name": "Fundlery",
    "explanation": "Our mission is to help health-related causes, non-profit organizations, and/or clinics through selling hand-crafted jewelry. The club is for those interested in furthering their passion in arts and healthcare...",
    "cleanedExplanation": "A club dedicated to supporting health-related causes, non-profit organizations, and clinics through the sale of hand-crafted jewelry."
  },
  {
    "name": "Kapacity",
    "explanation": "Kapacity is a student-led rock band that features electric guitars, bass, keyboard, drums, and vocals. We are a tight-knit crew of ~15 musically talented Penn students who love music. We feature genres such as but not limited to K-pop, British pop, Rock-Ballad, and Jazz.",
    "cleanedExplanation": "A student-led rock band at the University of Pennsylvania with a passion for music and a diverse range of genres."
  },
  {
    "name": "Keynotes A Cappella",
    "explanation": "We're a co-ed student a cappella group under the University of Pennsylvania that performs music spanning across a variety of genres...",
    "cleanedExplanation": "A co-ed student a cappella group at the University of Pennsylvania performing music across various genres."
  },
  {
    "name": "Monolith Arts Program",
    "explanation": "Be a part of the first UPenn Black art gallery showcase and Black Visual Arts Collective!...",
    "cleanedExplanation": "Participate in the first UPenn Black art gallery showcase and Black Visual Arts Collective. Celebrate and promote Black art at Penn."
  },
  {
    "name": "Off the Beat",
    "explanation": "Off The Beat is the premier modern rock & pop student a cappella group at the prestigious University of Pennsylvania...",
    "cleanedExplanation": "The premier modern rock & pop student a cappella group at the University of Pennsylvania."
  },
  {
    "name": "Onda Latina",
    "explanation": "In the Fall of 1996, a small group of students had the vision to educate the PENN community about Caribbean and Latino culture through dance...",
    "cleanedExplanation": "A group dedicated to educating the Penn community about Caribbean and Latino culture through dance."
  },
  {
    "name": "Pan-Asian Dance Troupe",
    "explanation": "We are a student dance troupe at the University of Pennsylvania seeking to celebrate and educate the community on Pan-Asian culture through traditional, modern, and fusion dances...",
    "cleanedExplanation": "A student dance troupe at the University of Pennsylvania celebrating and educating the community about Pan-Asian culture through dance."
  },
  {
    "name": "Penn Animation",
    "explanation": "Penn Animation is a student-run, multiple animator project production club at the University of Pennsylvania...",
    "cleanedExplanation": "A student-run animation club at the University of Pennsylvania focused on multiple animator project production."
  },
  {
    "name": "Penn Yoga and Meditation Community",
    "explanation": "We are a Penn student community that explore various practices such as meditation (e.g. chakra, transcendental, Buddhist, sound), yoga (e.g. vinyasa, kundalini), breathwork...",
    "cleanedExplanation": "A Penn student community exploring practices such as meditation, yoga, and breathwork to explore altered states of consciousness and their effects on emotions."
  },
  {
    "name": "Penn Atma",
    "explanation": "Atma is UPenn's award-winning, female-identifying South Asian fusion a cappella student group!...",
    "cleanedExplanation": "UPenn's award-winning, female-identifying South Asian fusion a cappella student group."
  },
  {
    "name": "Penn Ballet",
    "explanation": "Penn Ballet was created to allow ballet dancers of any level at the University of Pennsylvania to continue their classical ballet education...",
    "cleanedExplanation": "A student group at the University of Pennsylvania allowing ballet dancers of all levels to continue their classical ballet education."
  },
  {
    "name": "Penn Band",
    "explanation": "The Penn Band was founded in 1897, making us one of the oldest student groups on campus. With about 150 members from 25 states and 14 countries...",
    "cleanedExplanation": "Founded in 1897, the Penn Band is one of the oldest student groups on campus with about 150 members from diverse backgrounds."
  },
  {
    "name": "Penn Chinese Dance Club\n",
    "explanation": "The Penn Chinese Dance Club (PCDC) is a student-run, non-profit dance group dedicated to practicing classical and folk chinese dance. Founded in May 2006...",
    "cleanedExplanation": "A student-run, non-profit dance group at the University of Pennsylvania dedicated to practicing classical and folk Chinese dance."
  },
  {
    "name": "Penn Counterparts",
    "explanation": "Counterparts is Penn’s oldest all gender student a cappella group. Founded in 1981, Counterparts has a repertoire spanning from pop hits to jazz standards...",
    "cleanedExplanation": "Penn’s oldest all-gender student a cappella group, founded in 1981, with a repertoire spanning from pop hits to jazz standards."
  },
  {
    "name": "Penn Dance Company",
    "explanation": "Penn Dance was founded in 1975 as the first performing dance company at the University of Pennsylvania. Penn Dance is a co-ed, student-run dance company...",
    "cleanedExplanation": "Founded in 1975, Penn Dance is the first performing dance company at the University of Pennsylvania, featuring a co-ed, student-run team."
  },
  {
    "name": "Penn Dhamaka",
    "explanation": "Penn Dhamaka is the University of Pennsylvania's premier competitive all-male fusion dance troupe. Dhamaka peforms a variety of dance styles, including Bhangra...",
    "cleanedExplanation": "UPenn's premier competitive all-male fusion dance troupe, performing various dance styles including Bhangra and more."
  },
  {
    "name": "Penn Glee Club",
    "explanation": "The University of Pennsylvania Glee Club began modestly on November 5, 1862, when eight undergraduate men formed the Club, making it the oldest performing arts group at the University...",
    "cleanedExplanation": "The University of Pennsylvania Glee Club, founded in 1862, is the oldest performing arts group at the University, with a rich history of performances."
  },
  {
    "name": "Penn Hype Dance Crew",
    "explanation": "Penn Hype Dance Crew is a SAC-sponsored, co-ed, hip hop fusion student dance team at the University of Pennsylvania that creatively and uniquely explores various styles of traditional and modern dance...",
    "cleanedExplanation": "A SAC-sponsored, co-ed, hip hop fusion student dance team at the University of Pennsylvania creatively exploring various dance styles."
  },
  {
    "name": "Penn Jazz",
    "explanation": "Penn Jazz is a short name for the student-run Jazz Big Band at the University of Pennsylvania...",
    "cleanedExplanation": "Penn Jazz is a student-run Jazz Big Band at the University of Pennsylvania."
  },
  {
    "name": "Penn k-Beats",
    "explanation": "k-Beats is the only official undergraduate student dance group on the campus of the University of Pennsylvania that specializes in K-Pop dance. We aim to promote K-Pop culture through various performances on and off campus, on multiple social media channels, as well as through our annual show held on campus. Do you love dancing or jamming to K-Pop 🎧? If so, k-Beats is what you've been looking for. Come dance with us!",
    "cleanedExplanation": "The only official undergraduate student dance group at the University of Pennsylvania specializing in K-Pop dance. We promote K-Pop culture through performances, social media, and an annual show on campus."
  },
  {
    "name": "Penn Lions",
    "explanation": "Penn Lions is the Greater Philadelphia region's premier collegiate lion dance troupe. The troupe was formed in 2007 as a branch of Chinese Students Association and has since evolved into its own entity. Since then, this student group has performed not only on campus, but all across the East Coast for weddings, a countless number of schools, festivals, TV stations like NBC and ABC, Philadelphia's mayor Michael Nutter, the USMNT, and more!",
    "cleanedExplanation": "The premier collegiate lion dance troupe in the Greater Philadelphia region, founded in 2007 and associated with the Chinese Students Association. We perform at various events across the East Coast."
  },
  {
    "name": "Penn Masala",
    "explanation": "Penn Masala, comprised of students from the University of Pennsylvania, is the world’s first and premier South Asian a cappella group, founded in 1996 with the desire to create music that traversed traditional cultural boundaries and captured the experience of growing up with both Eastern and Western cultures. As the first group in the world to bring the sounds of the Indian subcontinent to a cappella, Masala has consistently been at the forefront of South Asian-Western fusion ever since. Since we started off in ’96, we’ve performed in India, at the White House, the Indian International Film Academy (IIFA) Awards, and the group was featured in the Hollywood feature film and soundtrack for Pitch Perfect 2. To date, Penn Masala has released 11 studio albums, most recently Musafir in February 2020.",
    "cleanedExplanation": "The world's first and premier South Asian a cappella group, founded in 1996 at the University of Pennsylvania. We create music that blends Eastern and Western cultures and have performed globally, including at the White House and in Hollywood."
  },
  {
    "name": "Penn Masti",
    "explanation": "Performing Arts Group: Student group at the University of Pennsylvania",
    "cleanedExplanation": "A student group at the University of Pennsylvania focused on the performing arts."
  },
  {
    "name": "Penn Raas",
    "explanation": "Garba Raas is an energetic Indian folk dance originating in Gujarat that has now evolved into a full-fledged competitive dance circuit in America. Formed in 2007, Penn Raas is UPenn's very own garba/raas team composed of both undergraduate and graduate students and is an official SAC funded University of Pennsylvania club.\nIn addition to performing in front of our hometown crowd at Penn, we have traveled across the country competing in several competitions such as Raas Chaos in Washington D.C., Maryland Masti, and Dandia on Fire at Penn State, even qualifying to compete at the Raas-All Stars National Championship in Dallas, TX in 2010.\nEach year, we hope to spread the passion of this dance form with traditional music mixed with upbeat tunes, a wildly vibrant choreographed dance piece, and strong facial energy that reflects the pure joy and fun of dancing with your friends that become family on stage.",
    "cleanedExplanation": "Penn Raas is UPenn's garba/raas dance team, formed in 2007 and composed of undergraduate and graduate students. We compete across the country and aim to spread the passion of this dance form."
  },
  {
    "name": "Penn Records",
    "explanation": "Penn Records is a student-run record label on campus focused on fostering the live music scene at Penn by functioning as an artist and event promoter. Penn Records aims to provide student artists, bands, and DJs with the necessary resources for performing their original music and succeeding in the music industry. Penn Records hosts concerts, open mics, and charity events.",
    "cleanedExplanation": "A student-run record label at the University of Pennsylvania dedicated to fostering the live music scene, supporting student artists, and promoting original music."
  },
  {
    "name": "Penn Sargam",
    "explanation": "Penn Sargam is one of America's first student-groups dedicated to promoting South Asian fusion music. Established in 2004 by students at the University of Pennsylvania, Sargam brings together music ranging from Hindustani, Carnatic and Western Classical to Bollywood, Pop and Rock. Our group is as diverse as our music, featuring musicians from all over the world.",
    "cleanedExplanation": "One of America's first student groups dedicated to promoting South Asian fusion music, founded in 2004 at the University of Pennsylvania. Our diverse music includes genres from classical to Bollywood and rock."
  },
  {
    "name": "Penn Shabbatones",
    "explanation": "The Shabbatones were founded in 2001 as the University of Pennsylvania’s premier student-run Jewish a cappella group.\n\nWe specialize in popular American, Israeli, and Jewish music, and all of our arrangements are composed, directed, and performed by students. Shabbatones members and alumni include undergraduate and graduate students. We come from a variety of Jewish backgrounds, unified by a love for Jewish music and a commitment to being the voice of one of the largest and most vibrant Hillels in the nation.\n\nIn the twenty years since the Shabbatones began, we have performed for a variety of audiences at Penn and throughout the world. During university semesters, the group enjoys performing at synagogues, schools, and other venues across the Northeast. During our winter breaks, the group has gone on tour to places including California, London, South Florida, Houston, and New Orleans. Some of our highlights include singing at the White House Chanukah Party, performing at sports games for the Phillies and the Sixers, and taking the stage at Disneyland.",
    "cleanedExplanation": "Founded in 2001, the Shabbatones are the University of Pennsylvania’s premier student-run Jewish a cappella group specializing in popular American, Israeli, and Jewish music. We perform at various venues and have toured internationally."
  },
  {
    "name": "Penn Singers Light Opera\nCompany",
    "explanation": "Penn Singers Light Opera Company is a four-year student musical theatre company based at the University of Pennsylvania that values inclusivity of all genders, races, sexual orientations, and identities. We are a tight-knit community of performers, musicians, and technicians committed to producing top-notch musical theatre and having fun!",
    "cleanedExplanation": "A four-year student musical theatre company based at the University of Pennsylvania. We value inclusivity and aim to produce high-quality musical theatre productions while having fun."
  },
  {
    "name": "Penn Six",
    "explanation": "Penn Six is Penn's premiere parody comedy acapella group. Just a bunch of people who like to sing, and long walks on the beach... We perform our own original parodies along with covers of your favorite pop and other hits. Sketch comedy and videos included at no additional charge.",
    "cleanedExplanation": "Penn Six is Penn's premier parody comedy a cappella group. We perform original parodies, covers of popular songs, and include sketch comedy and videos in our performances."
  },
  {
    "name": "Penn Symphony Orchestra",
    "explanation": "The Penn Symphony Orchestra was founded in 1878 and is comprised of musicians from throughout the University community, primarily non-music majors. Under the musical direction of Maestro Thomas Hong, this student ensemble rehearses three to four hours each week and performs a wide range of repertoire drawn from the eighteenth, nineteenth, and twentieth centuries. The Penn Symphony Orchestra rehearses and performs in historic Irvine Auditorium on Penn’s Campus.",
    "cleanedExplanation": "Founded in 1878, the Penn Symphony Orchestra is comprised of musicians from the University community, primarily non-music majors. We perform a wide range of repertoire and rehearse in historic Irvine Auditorium."
  },
  {
    "name": "PENNaach",
    "explanation": "PENNaach, the University of Pennsylvania's premier South Asian Dance Troupe was founded in 1997 to promote South Asian culture through forms of traditional, classical and modern dance. Naach is the oldest surviving Indian fusion dance team in the country.\n\nPENNaach's unique pieces fuse South Asian dance styles with Western dance styles.\n\nThe team performs in competitions and showcases both on and off-campus. An annual show each February presents self-choreographed pieces with styles from Bharatnatyam and Kathak to Garba and Bhangra to Modern Bollywood and Hip Hop and much more. Dancers on the team have the opportunity to learn many different dance styles as a result.",
    "cleanedExplanation": "Founded in 1997, PENNaach is the University of Pennsylvania's premier South Asian Dance Troupe, promoting South Asian culture through traditional, classical, and modern dance. We perform in competitions and showcases."
  },
  {
    "name": "PennSori A Cappella",
    "explanation": "PennSori is the premier Korean A Cappella Student Group at the University of Pennsylvania. We perform a mix of Korean and American songs of all genres (K-Pop, K-RnB, K-Ballad, K-HipHop, jazz, rock, pop, etc.) in order to serve as a cultural bridge between Korean and American cultures. We welcome students of any and all cultural backgrounds! Fluency in Korean is not at all required.",
    "cleanedExplanation": "PennSori is the premier Korean a cappella student group at the University of Pennsylvania. We perform a mix of Korean and American songs, aiming to bridge Korean and American cultures."
  },
  {
    "name": "PennTango",
    "explanation": "Tango classes for the Fall 2021 and Spring 2022 are contingent upon safety guidelines provided by the University of Pennsylvania.\n\nPennTango is a student group at the University of Pennsylvania which promotes the enjoyment of Argentine tango at the University of Pennsylvania by offering classes and a community of dancers. Argentine Tango is a highly social dance form, emphasizing connection and improvisation. PennTango's membership consists of a fun group of social dancers interested in improving their tango skills and building a larger community to go out dancing with! We are not a performance group, and do not limit membership or hold auditions. We are open to all Penn students, faculty, staff and alumni!",
    "cleanedExplanation": "PennTango promotes the enjoyment of Argentine tango at the University of Pennsylvania by offering classes and a community of dancers. We are open to all Penn students, faculty, staff, and alumni."
  },
  {
    "name": "Penny Loafers A Cappella",
    "explanation": "Founded in 1986, the Penny Loafers, or Loaf, is the University of Pennsylvania’s only all-gender indie-pop a cappella group. We perform an eclectic mix of songs in genres ranging from pop & indie to R&B, electronic, and more. To put it simply, we love introducing audiences to songs from up-and-coming artists and reinventing our favorite household jams.",
    "cleanedExplanation": "Founded in 1986, the Penny Loafers is the University of Pennsylvania’s only all-gender indie-pop a cappella group. We perform a diverse mix of songs and love introducing audiences to new music."
  },
  {
    "name": "PennYo",
    "explanation": "PennYo is Penn's premier Chinese student a cappella group and the first collegiate Chinese a cappella group in the United States. We hope to spread the love for Chinese music to the Philadelphia community and beyond. We welcome students of all backgrounds to audition! Chinese proficiency is not required (we have members from all around the world)! All of our arrangements are written by current and past PennYo members. Check out some of our music!",
    "cleanedExplanation": "PennYo is Penn's premier Chinese student a cappella group and the first collegiate Chinese a cappella group in the United States. We aim to spread the love for Chinese music and welcome students of all backgrounds."
  },
  {
    "name": "Polyphonia @ Penn",
    "explanation": "Polyphonia is Penn's first student-led joint Orchestra and Choir, performing works from early music to the modern day. We welcome all musicans; though we primarily expect to be composed of those instruments that make up a classical symphonic orchestra and choir, we absolutely are looking for creative ways to include nontraditional instruments into our repertoire as well!\nIf you're looking for a way to engage with the performing arts, but are worried about time committment, look no further! Polyphonia provides busy students an opportunity to continue engaging with the arts while keeping commitment attainable. Students may find it hard to maintain involvement with the arts while at Penn, so we hope to be able to create a space where they can enjoy music casually with the option of performance.\nFurthermore, Polyphonia is a great platform for meeting other musicians of various talents, as our wide reach encompasses many different musical instruments and styles. It's a great way to find others to perform that Brahms quartet you've been dying to do, and we also hope to offer a stage to perform that quartet upon!",
    "cleanedExplanation": "Polyphonia is Penn's first student-led joint Orchestra and Choir, welcoming musicians and aiming to engage students with the performing arts in a flexible way. We encourage all talents and offer opportunities for performances."
  },
  {
    "name": "Quaker Girls",
    "explanation": "The Quaker Girls Dance Team is a Penn student group that provides halftime entertainment at the University of Pennsylvania's Men's Football and Basketball games and supports the Red and Blue Penn spirit! We also dance at various campus events and fundraisers for other student groups. Each year, we perform at a Philadelphia 76ers game, one of our favorite events. Please contact us for information about joining the team!",
    "cleanedExplanation": "Quaker Girls Dance Team provides halftime entertainment at Penn's Men's Football and Basketball games, campus events, and fundraisers. We also perform at a Philadelphia 76ers game annually. Contact us for membership information!"
  },
  {
    "name": "Quaker Notes",
    "explanation": "Quaker Notes is the University of Pennsylvania's premier, nationally acclaimed all-female-identifying student a cappella group.\n\nWe sing a wide variety of music genres: pop, rock, r&b, and alternative. Our style is entertainment and we are committed to showing our audience a good time. All of our music is arranged by current Quaker Notes and alumnae, and we arrange & learn more than 20 new songs every year!",
    "cleanedExplanation": "Quaker Notes is Penn's premier all-female-identifying student a cappella group, known for performing various music genres. We arrange and learn over 20 new songs each year to entertain our audience."
  },
  {
    "name": "Simply Chaos",
    "explanation": "Simply Chaos is the University of Pennsylvania’s first and only stand-up student-run comedy collective. We perform at events around Philadelphia, sponsored campus events, and produce our own show every semester.",
    "cleanedExplanation": "Simply Chaos is Penn's first and only student-run stand-up comedy collective. We perform at various events in Philadelphia, sponsored campus events, and produce our own show every semester."
  },
  {
    "name": "Soundworks Tap Factory",
    "explanation": "We are a completely student-choreographed team that performs in and produces two shows during each academic year. Our unique style comes from the broad dance foundation of all our members, which includes rhythm tap, Broadway-style tap, hip-hop, jazz, and more! We bring in master tap teachers to help us continue to grow as tappers, though we consistently challenge each other with our own choreography!",
    "cleanedExplanation": "Soundworks Tap Factory is a student-choreographed team that performs and produces two shows each academic year. Our unique style blends various dance forms, including rhythm tap, Broadway-style tap, hip-hop, jazz, and more. We continuously challenge ourselves with our choreography."
  },
  {
    "name": "Sparks Dance Co",
    "explanation": "Sparks Dance Company (SDC) was founded in 1989 as Penn's premiere dance company dedicated to both performing and community service. The company, which is managed by undergraduate students, maintains a high technical level of many styles of dance including ballet, contemporary, jazz, tap, and hip hop.\n\nIn addition to weekly technique classes, each semester culminates with a self-choreographed show. Company members also perform at other popular campus events throughout the year such as the Emily Sachs Dance Benefit, various coffeehouses, and Student Performing Arts Night. In addition to all of these performance opportunities, SDC members share their love of dance through community service at various Philadelphia locales, such as the KIPP schools, the Salvation Army, and the Ronald McDonald house.",
    "cleanedExplanation": "Sparks Dance Company (SDC), founded in 1989, is Penn's premier dance company dedicated to performing and community service. We excel in various dance styles, including ballet, contemporary, jazz, tap, and hip hop. Our performances include self-choreographed shows and appearances at campus events and community service initiatives."
  },
  {
    "name": "Strictly Funk",
    "explanation": "Strictly Funk is the premiere hip-hop and contemporary student dance group here at the University of Pennsylvania. The company was formed in 1997 with the intention of transcending the traditional boundaries of dance. It has been developing a performance culture of its own ever since. This diverse company of 20+ members from all of the Penn undergraduate and graduate schools, as well as the greater Philadelphia area, seeks to explore hip-hop, jazz, contemporary, free-styling, lyrical, breaking, locking, popping, and funk, while still recognizing the personal styles of individual dancers. Funk has no limits.\n\nEach Funk show features an overarching theme, of which all numbers aim to explore from a different perspective. Theatrical dances and scenes implore both the audience and the dancers themselves to reconsider conventional paradigms through experimenting with movement. Shows run on a continuous soundtrack, breaking only for intermission, while also incorporating elaborate video and lighting.",
    "cleanedExplanation": "Strictly Funk is Penn's premiere hip-hop and contemporary student dance group, formed in 1997 to transcend traditional dance boundaries. Our diverse company of 20+ members explores various dance styles, including hip-hop, jazz, contemporary, lyrical, breaking, locking, popping, and funk. Our shows feature unique themes and aim to challenge conventional dance norms. Join us and experience the limitless world of funk!"
  },
  {
    "name": "TEDxPenn",
    "explanation": "TEDxPenn is a nonprofit organization founded in 2010 by students who sought to empower ideas within and around the Penn community. We hold a license at the University of Pennsylvania to host the largest student-run TEDx conference in the world, and today our TedTalks have amassed over 15 million views on Youtube with a wide range of speakers, from NFL players to Penn professors to the creator of Apple Emojis. This coming spring, we plan to host our annual conference where 1000 attendees are invited to engage with TedTalks about technology, entertainment, and design. Check out TED talks from our previous conferences here: https://www.youtube.com/results?search_query=tedxpenn\n\nThe TEDxPenn team is comprised of 30+ Penn students divided among five branches: Speaker & Content, Operations, Design, Marketing, Finance. We are recruiting members for each of these branches and encourage you to attend an information session to learn more about each team.",
    "cleanedExplanation": "TEDxPenn, a nonprofit founded by Penn students in 2010, empowers ideas within and around the Penn community. We host the world's largest student-run TEDx conference, with TedTalks totaling over 15 million views on Youtube. Our annual conference invites 1000 attendees to engage with technology, entertainment, and design topics. Join our team in various branches such as Speaker & Content, Operations, Design, Marketing, and Finance."
  },
  {
    "name": "The Excelano Project",
    "explanation": "The Excelano Project is the University of Pennsylvania’s first and premiere spoken word group. Supposedly derived from Latin, “excelano” means “we march forth” and from its foundation in 2001 by poets and then Penn students Carlos Gomez and Warren Longmire, EP has been doing just that. Performing on campus and having competed at the national level, The Excelano Project has made a name for itself. In 2007 and in 2009 we had the pleasure of taking home the College Union’s Poetry Slam Invitational title. Our poets have been featured at the White House, on HBO, at the famous Nuyorican Poets Cafe, on Broadway, and all around the world.\n\nBut EP goes beyond the poetry; we are a family. This group is about finding voice. It is dedicated to the power of the mic and using personal experience to touch the lives of audience members. It’s about breaking down barriers. It’s about holding a speaker up to life’s white noise, to find that every one of us can be heard.",
    "cleanedExplanation": "The Excelano Project is Penn's first spoken word group, founded in 2001. We perform on campus and compete nationally, earning recognition and accolades. Our poets have been featured at prestigious venues worldwide. Beyond poetry, we are a family dedicated to finding our voices and breaking down barriers through personal experiences. Join us in making every voice heard."
  }
 ]